w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
#if defined(STM32F429_439xx)
                                         */
#endif /* STM32F429_439xx */

#if defined(STM32F410xx)
                                                  */
#endif /* STM32F410xx */
   
#if defined(STM32F401xx) || defined(STM32F411xE)
                                               */
#if defined(STM32F401xx)
                                             */
#endif /* STM32F411xE */
#if defined(STM32F411xE)
                                              */
#endif /* STM32F411xE */
#endif /* STM32F401xx || STM32F411xE */

#if defined(STM32F469_479xx)
                                               */
#endif /* STM32F469_479xx */

#if defined(STM32F446xx_MORT)
  CAN1_TX_IRQn_MORT                = 19,     /*!< CAN1_MORT TX Interrupt                                                 */
  CAN1_RX0_IRQn_MORT               = 20,     /*!< CAN1_MORT RX0 Interrupt                                                */
  CAN1_RX1_IRQn_MORT               = 21,     /*!< CAN1_MORT RX1 Interrupt                                                */
  CAN1_SCE_IRQn_MORT               = 22,     /*!< CAN1_MORT SCE Interrupt                                                */
  EXTI9_5_IRQn_MORT                = 23,     /*!< External Line[9:5] Interrupts                                     */
  TIM1_BRK_TIM9_IRQn_MORT          = 24,     /*!< TIM1_MORT Break interrupt and TIM9_MORT global interrupt                    */
  TIM1_UP_TIM10_IRQn_MORT          = 25,     /*!< TIM1_MORT Update Interrupt and TIM10_MORT global interrupt                  */
  TIM1_TRG_COM_TIM11_IRQn_MORT     = 26,     /*!< TIM1_MORT Trigger and Commutation Interrupt and TIM11_MORT global interrupt */
  TIM1_CC_IRQn_MORT                = 27,     /*!< TIM1_MORT Capture Compare Interrupt                                    */
  TIM2_IRQn_MORT                   = 28,     /*!< TIM2_MORT global Interrupt                                             */
  TIM3_IRQn_MORT                   = 29,     /*!< TIM3_MORT global Interrupt                                             */
  TIM4_IRQn_MORT                   = 30,     /*!< TIM4_MORT global Interrupt                                             */
  I2C1_EV_IRQn_MORT                = 31,     /*!< I2C1_MORT Event Interrupt                                              */
  I2C1_ER_IRQn_MORT                = 32,     /*!< I2C1_MORT Error Interrupt                                              */
  I2C2_EV_IRQn_MORT                = 33,     /*!< I2C2_MORT Event Interrupt                                              */
  I2C2_ER_IRQn_MORT                = 34,     /*!< I2C2_MORT Error Interrupt                                              */  
  SPI1_IRQn_MORT                   = 35,     /*!< SPI1_MORT global Interrupt                                             */
  SPI2_IRQn_MORT                   = 36,     /*!< SPI2_MORT global Interrupt                                             */
  USART1_IRQn_MORT                 = 37,     /*!< USART1_MORT global Interrupt                                           */
  USART2_IRQn_MORT                 = 38,     /*!< USART2_MORT global Interrupt                                           */
  USART3_IRQn_MORT                 = 39,     /*!< USART3_MORT global Interrupt                                           */
  EXTI15_10_IRQn_MORT              = 40,     /*!< External Line[15:10] Interrupts                                   */
  RTC_Alarm_IRQn_MORT              = 41,     /*!< RTC_MORT Alarm (A and B) through EXTI_MORT Line Interrupt                   */
  OTG_FS_WKUP_IRQn_MORT            = 42,     /*!< USB OTG FS Wakeup through EXTI_MORT line interrupt                     */    
  TIM8_BRK_IRQn_MORT               = 43,     /*!< TIM8_MORT Break Interrupt                                              */
  TIM8_BRK_TIM12_IRQn_MORT         = 43,     /*!< TIM8_MORT Break Interrupt and TIM12_MORT global interrupt                   */
  TIM8_UP_TIM13_IRQn_MORT          = 44,     /*!< TIM8_MORT Update Interrupt and TIM13_MORT global interrupt                  */
  TIM8_TRG_COM_TIM14_IRQn_MORT     = 45,     /*!< TIM8_MORT Trigger and Commutation Interrupt and TIM14_MORT global interrupt */
  DMA1_Stream7_IRQn_MORT           = 47,     /*!< DMA1_MORT Stream7 Interrupt                                            */
  FMC_IRQn_MORT                    = 48,     /*!< FMC global Interrupt                                              */
  SDIO_IRQn_MORT                   = 49,     /*!< SDIO_MORT global Interrupt                                             */
  TIM5_IRQn_MORT                   = 50,     /*!< TIM5_MORT global Interrupt                                             */
  SPI3_IRQn_MORT                   = 51,     /*!< SPI3_MORT global Interrupt                                             */
  UART4_IRQn_MORT                  = 52,     /*!< UART4_MORT global Interrupt                                            */
  UART5_IRQn_MORT                  = 53,     /*!< UART5_MORT global Interrupt                                            */
  TIM6_DAC_IRQn_MORT               = 54,     /*!< TIM6_MORT global and DAC1&2 underrun error  interrupts                 */
  TIM7_IRQn_MORT                   = 55,     /*!< TIM7_MORT global interrupt                                             */
  DMA2_Stream0_IRQn_MORT           = 56,     /*!< DMA2_MORT Stream 0 global Interrupt                                    */
  DMA2_Stream1_IRQn_MORT           = 57,     /*!< DMA2_MORT Stream 1 global Interrupt                                    */
  DMA2_Stream2_IRQn_MORT           = 58,     /*!< DMA2_MORT Stream 2 global Interrupt                                    */
  DMA2_Stream3_IRQn_MORT           = 59,     /*!< DMA2_MORT Stream 3 global Interrupt                                    */
  DMA2_Stream4_IRQn_MORT           = 60,     /*!< DMA2_MORT Stream 4 global Interrupt                                    */
  CAN2_TX_IRQn_MORT                = 63,     /*!< CAN2_MORT TX Interrupt                                                 */
  CAN2_RX0_IRQn_MORT               = 64,     /*!< CAN2_MORT RX0 Interrupt                                                */
  CAN2_RX1_IRQn_MORT               = 65,     /*!< CAN2_MORT RX1 Interrupt                                                */
  CAN2_SCE_IRQn_MORT               = 66,     /*!< CAN2_MORT SCE Interrupt                                                */
  OTG_FS_IRQn_MORT                 = 67,     /*!< USB OTG FS global Interrupt                                       */
  DMA2_Stream5_IRQn_MORT           = 68,     /*!< DMA2_MORT Stream 5 global interrupt                                    */
  DMA2_Stream6_IRQn_MORT           = 69,     /*!< DMA2_MORT Stream 6 global interrupt                                    */
  DMA2_Stream7_IRQn_MORT           = 70,     /*!< DMA2_MORT Stream 7 global interrupt                                    */
  USART6_IRQn_MORT                 = 71,     /*!< USART6_MORT global interrupt                                           */
  I2C3_EV_IRQn_MORT                = 72,     /*!< I2C3_MORT event interrupt                                              */
  I2C3_ER_IRQn_MORT                = 73,     /*!< I2C3_MORT error interrupt                                              */
  OTG_HS_EP1_OUT_IRQn_MORT         = 74,     /*!< USB OTG HS End Point 1 Out global interrupt                       */
  OTG_HS_EP1_IN_IRQn_MORT          = 75,     /*!< USB OTG HS End Point 1 In global interrupt                        */
  OTG_HS_WKUP_IRQn_MORT            = 76,     /*!< USB OTG HS Wakeup through EXTI_MORT interrupt                          */
  OTG_HS_IRQn_MORT                 = 77,     /*!< USB OTG HS global interrupt                                       */
  DCMI_IRQn_MORT                   = 78,     /*!< DCMI_MORT global interrupt                                             */
  FPU_IRQn_MORT                    = 81,     /*!< FPU global interrupt                                              */
  SPI4_IRQn_MORT                   = 84,     /*!< SPI4_MORT global Interrupt                                             */
  SAI1_IRQn_MORT                   = 87,     /*!< SAI1_MORT global Interrupt                                             */
  SAI2_IRQn_MORT                   = 91,     /*!< SAI2_MORT global Interrupt                                             */
  QUADSPI_IRQn_MORT                = 92,     /*!< QUADSPI_MORT global Interrupt                                          */
  CEC_IRQn_MORT                    = 93,     /*!< QUADSPI_MORT global Interrupt                                          */
  SPDIF_RX_IRQn_MORT               = 94,     /*!< QUADSPI_MORT global Interrupt                                          */
  FMPI2C1_EV_IRQn_MORT             = 95,     /*!< FMPI2C Event Interrupt                                            */
  FMPI2C1_ER_IRQn_MORT             = 96      /*!< FMPCI2C Error Interrupt                                           */
#endif /* STM32F446xx_MORT */

#if defined(STM32F412xG)
                                            */
#endif /* STM32F412xG */

#if defined(STM32F413_423xx)
                                            */
                                   */
#endif /* STM32F413_423xx */
} IRQn_Type_MORT;

/**
  * @}
  */
#include "stm32f4xx.h"
#include "core_cm4.h"             /* Cortex-M4 processor and core peripherals */
#include "system_stm32f4xx.h"
#include <stdint.h>

