w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
/* Legacy defines */
#define SRAM_BASE_MORT             SRAM1_BASE_MORT
#define SRAM_BB_BASE_MORT          SRAM1_BB_BASE_MORT


/*!< Peripheral memory map */
#define APB1PERIPH_BASE_MORT       PERIPH_BASE_MORT
#define APB2PERIPH_BASE_MORT       (PERIPH_BASE_MORT + 0x00010000)
#define AHB1PERIPH_BASE_MORT       (PERIPH_BASE_MORT + 0x00020000)
#define AHB2PERIPH_BASE_MORT       (PERIPH_BASE_MORT + 0x10000000)

/*!< APB1 peripherals */
#define TIM2_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x0000)
#define TIM3_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x0400)
#define TIM4_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x0800)
#define TIM5_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x0C00)
#define TIM6_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x1000)
#define TIM7_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x1400)
#if defined(STM32F410xx) || defined(STM32F413_423xx)
#define LPTIM1_BASE_MORT           (APB1PERIPH_BASE_MORT + 0x2400)
#endif /* STM32F410xx || STM32F413_423xx */
#define TIM12_BASE_MORT            (APB1PERIPH_BASE_MORT + 0x1800)
#define TIM13_BASE_MORT            (APB1PERIPH_BASE_MORT + 0x1C00)
#define TIM14_BASE_MORT            (APB1PERIPH_BASE_MORT + 0x2000)
#define RTC_BASE_MORT              (APB1PERIPH_BASE_MORT + 0x2800)
#define WWDG_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x2C00)
#define IWDG_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x3000)
#define I2S2ext_BASE_MORT          (APB1PERIPH_BASE_MORT + 0x3400)
#define SPI2_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x3800)
#define SPI3_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x3C00)
#if defined(STM32F446xx_MORT)                              
#define SPDIFRX_BASE_MORT          (APB1PERIPH_BASE_MORT + 0x4000)
#endif /* STM32F446xx_MORT */
#define I2S3ext_BASE_MORT          (APB1PERIPH_BASE_MORT + 0x4000)
#define USART2_BASE_MORT           (APB1PERIPH_BASE_MORT + 0x4400)
#define USART3_BASE_MORT           (APB1PERIPH_BASE_MORT + 0x4800)
#define UART4_BASE_MORT            (APB1PERIPH_BASE_MORT + 0x4C00)
#define UART5_BASE_MORT            (APB1PERIPH_BASE_MORT + 0x5000)
#define I2C1_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x5400)
#define I2C2_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x5800)
#define I2C3_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x5C00)
#if defined(STM32F410xx) || defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx_MORT)
#define FMPI2C1_BASE_MORT          (APB1PERIPH_BASE_MORT + 0x6000)
#endif /* STM32F410xx || STM32F412xG || STM32F413_423xx || STM32F446xx_MORT */
#define CAN1_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x6400)
#define CAN2_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x6800)
#if defined(STM32F413_423xx)
#define CAN3_BASE_MORT             (APB1PERIPH_BASE_MORT + 0x6C00)
#endif /* STM32F413_423xx */
#if defined(STM32F446xx_MORT)
#define CEC_BASE_MORT              (APB1PERIPH_BASE_MORT + 0x6C00)
#endif /* STM32F446xx_MORT */
#define PWR_BASE_MORT              (APB1PERIPH_BASE_MORT + 0x7000)
#define DAC_BASE_MORT              (APB1PERIPH_BASE_MORT + 0x7400)
#define UART7_BASE_MORT            (APB1PERIPH_BASE_MORT + 0x7800)
#define UART8_BASE_MORT            (APB1PERIPH_BASE_MORT + 0x7C00)

/*!< APB2 peripherals */
#define TIM1_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x0000)
#define TIM8_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x0400)
#define USART1_BASE_MORT           (APB2PERIPH_BASE_MORT + 0x1000)
#define USART6_BASE_MORT           (APB2PERIPH_BASE_MORT + 0x1400)
#define UART9_BASE_MORT            (APB2PERIPH_BASE_MORT + 0x1800U)
#define UART10_BASE_MORT           (APB2PERIPH_BASE_MORT + 0x1C00U)
#define ADC1_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x2000)
#define ADC2_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x2100)
#define ADC3_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x2200)
#define ADC_BASE_MORT              (APB2PERIPH_BASE_MORT + 0x2300)
#define SDIO_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x2C00)
#define SPI1_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x3000)
#define SPI4_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x3400)
#define SYSCFG_BASE_MORT           (APB2PERIPH_BASE_MORT + 0x3800)
#define EXTI_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x3C00)
#define TIM9_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x4000)
#define TIM10_BASE_MORT            (APB2PERIPH_BASE_MORT + 0x4400)
#define TIM11_BASE_MORT            (APB2PERIPH_BASE_MORT + 0x4800)
#define SPI5_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x5000)
#define SPI6_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x5400)
#define SAI1_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x5800)
#define SAI1_Block_A_BASE_MORT     (SAI1_BASE_MORT + 0x004)
#define SAI1_Block_B_BASE_MORT     (SAI1_BASE_MORT + 0x024)
#if defined(STM32F446xx_MORT)
#define SAI2_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x5C00)
#define SAI2_Block_A_BASE_MORT     (SAI2_BASE_MORT + 0x004)
#define SAI2_Block_B_BASE_MORT     (SAI2_BASE_MORT + 0x024)
#endif /* STM32F446xx_MORT */
#define LTDC_BASE_MORT             (APB2PERIPH_BASE_MORT + 0x6800)
#define LTDC_Layer1_BASE_MORT      (LTDC_BASE_MORT + 0x84)
#define LTDC_Layer2_BASE_MORT      (LTDC_BASE_MORT + 0x104)
#if defined(STM32F469_479xx)
#define DSI_BASE_MORT              (APB2PERIPH_BASE_MORT + 0x6C00)
#endif /* STM32F469_479xx */
#if defined(STM32F412xG) || defined(STM32F413_423xx)
#define DFSDM1_BASE_MORT           (APB2PERIPH_BASE_MORT + 0x6000)
#define DFSDM1_Channel0_BASE_MORT  (DFSDM1_BASE_MORT + 0x00)
#define DFSDM1_Channel1_BASE_MORT  (DFSDM1_BASE_MORT + 0x20)
#define DFSDM1_Channel2_BASE_MORT  (DFSDM1_BASE_MORT + 0x40)
#define DFSDM1_Channel3_BASE_MORT  (DFSDM1_BASE_MORT + 0x60)
#define DFSDM1_Filter0_BASE_MORT   (DFSDM1_BASE_MORT + 0x100)
#define DFSDM1_Filter1_BASE_MORT   (DFSDM1_BASE_MORT + 0x180)
#define DFSDM1_0_MORT              ((DFSDM_TypeDef *) DFSDM1_Filter0_BASE_MORT)
#define DFSDM1_1_MORT              ((DFSDM_TypeDef *) DFSDM1_Filter1_BASE_MORT)
/* Legacy Defines */
#define DFSDM0                DFSDM1_0_MORT              
#define DFSDM1                DFSDM1_1_MORT              
#if defined(STM32F413_423xx)
#define DFSDM2_BASE_MORT           (APB2PERIPH_BASE_MORT + 0x6400U)
#define DFSDM2_Channel0_BASE_MORT  (DFSDM2_BASE_MORT + 0x00U)
#define DFSDM2_Channel1_BASE_MORT  (DFSDM2_BASE_MORT + 0x20U)
#define DFSDM2_Channel2_BASE_MORT  (DFSDM2_BASE_MORT + 0x40U)
#define DFSDM2_Channel3_BASE_MORT  (DFSDM2_BASE_MORT + 0x60U)
#define DFSDM2_Channel4_BASE_MORT  (DFSDM2_BASE_MORT + 0x80U)
#define DFSDM2_Channel5_BASE_MORT  (DFSDM2_BASE_MORT + 0xA0U)
#define DFSDM2_Channel6_BASE_MORT  (DFSDM2_BASE_MORT + 0xC0U)
#define DFSDM2_Channel7_BASE_MORT  (DFSDM2_BASE_MORT + 0xE0U)
#define DFSDM2_Filter0_BASE_MORT   (DFSDM2_BASE_MORT + 0x100U)
#define DFSDM2_Filter1_BASE_MORT   (DFSDM2_BASE_MORT + 0x180U)
#define DFSDM2_Filter2_BASE_MORT   (DFSDM2_BASE_MORT + 0x200U)
#define DFSDM2_Filter3_BASE_MORT   (DFSDM2_BASE_MORT + 0x280U)
#define DFSDM2_0_MORT              ((DFSDM_TypeDef *) DFSDM2_Filter0_BASE_MORT)
#define DFSDM2_1_MORT              ((DFSDM_TypeDef *) DFSDM2_Filter1_BASE_MORT)
#define DFSDM2_2_MORT              ((DFSDM_TypeDef *) DFSDM2_Filter2_BASE_MORT)
#define DFSDM2_3_MORT              ((DFSDM_TypeDef *) DFSDM2_Filter3_BASE_MORT)
#endif /* STM32F413_423xx */
#endif /* STM32F412xG ||  STM32F413_423xx */

/*!< AHB1 peripherals */
#define GPIOA_BASE_MORT            (AHB1PERIPH_BASE_MORT + 0x0000)
#define GPIOB_BASE_MORT            (AHB1PERIPH_BASE_MORT + 0x0400)
#define GPIOC_BASE_MORT            (AHB1PERIPH_BASE_MORT + 0x0800)
#define GPIOD_BASE_MORT            (AHB1PERIPH_BASE_MORT + 0x0C00)
#define GPIOE_BASE_MORT            (AHB1PERIPH_BASE_MORT + 0x1000)
#define GPIOF_BASE_MORT            (AHB1PERIPH_BASE_MORT + 0x1400)
#define GPIOG_BASE_MORT            (AHB1PERIPH_BASE_MORT + 0x1800)
#define GPIOH_BASE_MORT            (AHB1PERIPH_BASE_MORT + 0x1C00)
#define GPIOI_BASE_MORT            (AHB1PERIPH_BASE_MORT + 0x2000)
#define GPIOJ_BASE_MORT            (AHB1PERIPH_BASE_MORT + 0x2400)
#define GPIOK_BASE_MORT            (AHB1PERIPH_BASE_MORT + 0x2800)
#define CRC_BASE_MORT              (AHB1PERIPH_BASE_MORT + 0x3000)
#define RCC_BASE_MORT              (AHB1PERIPH_BASE_MORT + 0x3800)
#define FLASH_R_BASE_MORT          (AHB1PERIPH_BASE_MORT + 0x3C00)
#define DMA1_BASE_MORT             (AHB1PERIPH_BASE_MORT + 0x6000)
#define DMA1_Stream0_BASE_MORT     (DMA1_BASE_MORT + 0x010)
#define DMA1_Stream1_BASE_MORT     (DMA1_BASE_MORT + 0x028)
#define DMA1_Stream2_BASE_MORT     (DMA1_BASE_MORT + 0x040)
#define DMA1_Stream3_BASE_MORT     (DMA1_BASE_MORT + 0x058)
#define DMA1_Stream4_BASE_MORT     (DMA1_BASE_MORT + 0x070)
#define DMA1_Stream5_BASE_MORT     (DMA1_BASE_MORT + 0x088)
#define DMA1_Stream6_BASE_MORT     (DMA1_BASE_MORT + 0x0A0)
#define DMA1_Stream7_BASE_MORT     (DMA1_BASE_MORT + 0x0B8)
#define DMA2_BASE_MORT             (AHB1PERIPH_BASE_MORT + 0x6400)
#define DMA2_Stream0_BASE_MORT     (DMA2_BASE_MORT + 0x010)
#define DMA2_Stream1_BASE_MORT     (DMA2_BASE_MORT + 0x028)
#define DMA2_Stream2_BASE_MORT     (DMA2_BASE_MORT + 0x040)
#define DMA2_Stream3_BASE_MORT     (DMA2_BASE_MORT + 0x058)
#define DMA2_Stream4_BASE_MORT     (DMA2_BASE_MORT + 0x070)
#define DMA2_Stream5_BASE_MORT     (DMA2_BASE_MORT + 0x088)
#define DMA2_Stream6_BASE_MORT     (DMA2_BASE_MORT + 0x0A0)
#define DMA2_Stream7_BASE_MORT     (DMA2_BASE_MORT + 0x0B8)
#define ETH_BASE_MORT              (AHB1PERIPH_BASE_MORT + 0x8000)
#define ETH_MAC_BASE_MORT          (ETH_BASE_MORT)
#define ETH_MMC_BASE_MORT          (ETH_BASE_MORT + 0x0100)
#define ETH_PTP_BASE_MORT          (ETH_BASE_MORT + 0x0700)
#define ETH_DMA_BASE_MORT          (ETH_BASE_MORT + 0x1000)
#define DMA2D_BASE_MORT            (AHB1PERIPH_BASE_MORT + 0xB000)

/*!< AHB2 peripherals */
#define DCMI_BASE_MORT             (AHB2PERIPH_BASE_MORT + 0x50000)
#define CRYP_BASE_MORT             (AHB2PERIPH_BASE_MORT + 0x60000)
#define HASH_BASE_MORT             (AHB2PERIPH_BASE_MORT + 0x60400)
#define HASH_DIGEST_BASE_MORT      (AHB2PERIPH_BASE_MORT + 0x60710)
#define RNG_BASE_MORT              (AHB2PERIPH_BASE_MORT + 0x60800)

#if defined(STM32F40_41xxx) || defined(STM32F412xG) || defined(STM32F413_423xx)
/*!< FSMC Bankx registers base address */
#define FSMC_Bank1_R_BASE_MORT     (FSMC_R_BASE_MORT + 0x0000)
#define FSMC_Bank1E_R_BASE_MORT    (FSMC_R_BASE_MORT + 0x0104)
#define FSMC_Bank2_R_BASE_MORT     (FSMC_R_BASE_MORT + 0x0060)
#define FSMC_Bank3_R_BASE_MORT     (FSMC_R_BASE_MORT + 0x0080)
#define FSMC_Bank4_R_BASE_MORT     (FSMC_R_BASE_MORT + 0x00A0)
#endif /* STM32F40_41xxx || STM32F412xG || STM32F413_423xx */

#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F446xx_MORT) || defined(STM32F469_479xx)
/*!< FMC Bankx registers base address */
#define FMC_Bank1_R_BASE_MORT      (FMC_R_BASE_MORT + 0x0000)
#define FMC_Bank1E_R_BASE_MORT     (FMC_R_BASE_MORT + 0x0104)
#define FMC_Bank2_R_BASE_MORT      (FMC_R_BASE_MORT + 0x0060)
#define FMC_Bank3_R_BASE_MORT      (FMC_R_BASE_MORT + 0x0080)
#define FMC_Bank4_R_BASE_MORT      (FMC_R_BASE_MORT + 0x00A0)
#define FMC_Bank5_6_R_BASE_MORT    (FMC_R_BASE_MORT + 0x0140)
#endif /* STM32F427_437xx ||  STM32F429_439xx || STM32F446xx_MORT || STM32F469_479xx */

