w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
/********************  Bit definition for CAN_IER register  *******************/


/********************  Bit definition for CAN_ESR register  *******************/

/*******************  Bit definition for CAN_BTR register  ********************/


/*!<Mailbox registers */
/******************  Bit definition for CAN_TI0R register  ********************/


/******************  Bit definition for CAN_TDT0R register  *******************/

/******************  Bit definition for CAN_TDL0R register  *******************/


/******************  Bit definition for CAN_TDH0R register  *******************/

/*******************  Bit definition for CAN_TI1R register  *******************/


/*******************  Bit definition for CAN_TDT1R register  ******************/


/*******************  Bit definition for CAN_TDL1R register  ******************/


/*******************  Bit definition for CAN_TDH1R register  ******************/


/*******************  Bit definition for CAN_TI2R register  *******************/

/*******************  Bit definition for CAN_TDT2R register  ******************/  


/*******************  Bit definition for CAN_TDL2R register  ******************/


/*******************  Bit definition for CAN_TDH2R register  ******************/


/*******************  Bit definition for CAN_RI0R register  *******************/


/*******************  Bit definition for CAN_RDT0R register  ******************/


/*******************  Bit definition for CAN_RDL0R register  ******************/


/*******************  Bit definition for CAN_RDH0R register  ******************/


/*******************  Bit definition for CAN_RI1R register  *******************/


/*******************  Bit definition for CAN_RDT1R register  ******************/


/*******************  Bit definition for CAN_RDL1R register  ******************/


/*******************  Bit definition for CAN_RDH1R register  ******************/


/*!<CAN filter registers */
/*******************  Bit definition for CAN_FMR register  ********************/


/*******************  Bit definition for CAN_FM1R register  *******************/


/*******************  Bit definition for CAN_FS1R register  *******************/


/******************  Bit definition for CAN_FFA1R register  *******************/


/*******************  Bit definition for CAN_FA1R register  *******************/


/*******************  Bit definition for CAN_F0R1 register  *******************/


/*******************  Bit definition for CAN_F1R1 register  *******************/


/*******************  Bit definition for CAN_F2R1 register  *******************/


/*******************  Bit definition for CAN_F3R1 register  *******************/


/*******************  Bit definition for CAN_F4R1 register  *******************/


/*******************  Bit definition for CAN_F5R1 register  *******************/


/*******************  Bit definition for CAN_F6R1 register  *******************/


/*******************  Bit definition for CAN_F7R1 register  *******************/


/*******************  Bit definition for CAN_F8R1 register  *******************/


/*******************  Bit definition for CAN_F9R1 register  *******************/


/*******************  Bit definition for CAN_F10R1 register  ******************/

/*******************  Bit definition for CAN_F11R1 register  ******************/


/*******************  Bit definition for CAN_F12R1 register  ******************/


/*******************  Bit definition for CAN_F13R1 register  ******************/


/*******************  Bit definition for CAN_F0R2 register  *******************/


/*******************  Bit definition for CAN_F1R2 register  *******************/


/*******************  Bit definition for CAN_F2R2 register  *******************/


/*******************  Bit definition for CAN_F3R2 register  *******************/

/*******************  Bit definition for CAN_F4R2 register  *******************/


/*******************  Bit definition for CAN_F5R2 register  *******************/

/*******************  Bit definition for CAN_F6R2 register  *******************/


/*******************  Bit definition for CAN_F7R2 register  *******************/


/*******************  Bit definition for CAN_F8R2 register  *******************/


/*******************  Bit definition for CAN_F9R2 register  *******************/

/*******************  Bit definition for CAN_F10R2 register  ******************/

/*******************  Bit definition for CAN_F11R2 register  ******************/


/*******************  Bit definition for CAN_F12R2 register  ******************/


/*******************  Bit definition for CAN_F13R2 register  ******************/



#if defined(STM32F446xx_MORT)
/******************************************************************************/
/*                                                                            */
/*                          HDMI-CEC_MORT (CEC_MORT)                                    */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for CEC_CR register  *********************/
#define  CEC_CR_CECEN_MORT                        ((uint32_t)0x00000001)       /*!< CEC_MORT Enable                              */
#define  CEC_CR_TXSOM_MORT                        ((uint32_t)0x00000002)       /*!< CEC_MORT Tx Start Of Message                 */
#define  CEC_CR_TXEOM_MORT                        ((uint32_t)0x00000004)       /*!< CEC_MORT Tx End Of Message                   */

/*******************  Bit definition for CEC_CFGR register  *******************/
#define  CEC_CFGR_SFT_MORT                        ((uint32_t)0x00000007)       /*!< CEC_MORT Signal Free Time                    */
#define  CEC_CFGR_RXTOL_MORT                      ((uint32_t)0x00000008)       /*!< CEC_MORT Tolerance                           */
#define  CEC_CFGR_BRESTP_MORT                     ((uint32_t)0x00000010)       /*!< CEC_MORT Rx Stop                             */
#define  CEC_CFGR_BREGEN_MORT                     ((uint32_t)0x00000020)       /*!< CEC_MORT Bit Rising Error generation         */
#define  CEC_CFGR_LREGEN_MORT                     ((uint32_t)0x00000040)       /*!< CEC_MORT Long Period Error generation        */
#define  CEC_CFGR_SFTOPT_MORT                     ((uint32_t)0x00000100)       /*!< CEC_MORT Signal Free Time optional           */
#define  CEC_CFGR_BRDNOGEN_MORT                   ((uint32_t)0x00000080)       /*!< CEC_MORT Broadcast No error generation       */
#define  CEC_CFGR_OAR_MORT                        ((uint32_t)0x7FFF0000)       /*!< CEC_MORT Own Address                         */
#define  CEC_CFGR_LSTN_MORT                       ((uint32_t)0x80000000)       /*!< CEC_MORT Listen mode                         */

