w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
/********************  Bit definition for DAC_SR register  ********************/
#define  DAC_SR_DMAUDR1_MORT                      ((uint32_t)0x00002000)        /*!<DAC_MORT channel1 DMA underrun flag */
#define  DAC_SR_DMAUDR2_MORT                      ((uint32_t)0x20000000)        /*!<DAC_MORT channel2 DMA underrun flag */

/******************************************************************************/
/*                                                                            */
/*                                 Debug MCU                                  */
/*                                                                            */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                                    DCMI_MORT                                    */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DCMI_CR register  ******************/


/********************  Bits definition for DCMI_SR register  ******************/


/********************  Bits definition for DCMI_RIS register  *****************/

/* Legacy defines */


/********************  Bits definition for DCMI_IER register  *****************/


/* Legacy defines */


/********************  Bits definition for DCMI_MIS register  ****************/


/* Legacy defines */


/********************  Bits definition for DCMI_ICR register  *****************/


/* Legacy defines */

/********************  Bits definition for DCMI_ESCR register  ******************/


/********************  Bits definition for DCMI_ESUR register  ******************/


/********************  Bits definition for DCMI_CWSTRT register  ******************/


/********************  Bits definition for DCMI_CWSIZE register  ******************/


/********************  Bits definition for DCMI_DR register  ******************/


/******************************************************************************/
/*                                                                            */
/*                 Digital Filter for Sigma Delta Modulators                  */
/*                                                                            */
/******************************************************************************/

/****************   DFSDM channel configuration registers  ********************/

/***************  Bit definition for DFSDM_CHCFGR1 register  ******************/

/***************  Bit definition for DFSDM_CHCFGR2 register  ******************/

/******************  Bit definition for DFSDM_CHAWSCDR register ***************/

/****************  Bit definition for DFSDM_CHWDATR register *******************/

/****************  Bit definition for DFSDM_CHDATINR register *****************/

/************************   DFSDM module registers  ****************************/

/*****************  Bit definition for DFSDM_FLTCR1 register *******************/

/********************  Bit definition for DFSDM_FLTCR2 register ***************/

/*****************  Bit definition for DFSDM_FLTISR register *******************/

/*****************  Bit definition for DFSDM_FLTICR register *******************/

/****************  Bit definition for DFSDM_FLTJCHGR register ******************/

/*****************  Bit definition for DFSDM_FLTFCR register *******************/

/***************  Bit definition for DFSDM_FLTJDATAR register *****************/

/***************  Bit definition for DFSDM_FLTRDATAR register *****************/

/***************  Bit definition for DFSDM_FLTAWHTR register ******************/

/***************  Bit definition for DFSDM_FLTAWLTR register ******************/

/***************  Bit definition for DFSDM_FLTAWSR register *******************/

/***************  Bit definition for DFSDM_FLTAWCFR register ******************/

/***************  Bit definition for DFSDM_FLTEXMAX register ******************/

/***************  Bit definition for DFSDM_FLTEXMIN register ******************/

/***************  Bit definition for DFSDM_FLTCNVTIMR register ****************/

/******************************************************************************/
/*                                                                            */
/*                             DMA Controller                                 */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DMA_SxCR register  *****************/ 
#define DMA_SxCR_CHSEL_MORT                       ((uint32_t)0x0E000000)
#define DMA_SxCR_CHSEL_0_MORT                     ((uint32_t)0x02000000)
#define DMA_SxCR_CHSEL_1_MORT                     ((uint32_t)0x04000000)
#define DMA_SxCR_CHSEL_2_MORT                     ((uint32_t)0x08000000) 
#define DMA_SxCR_MBURST_MORT                      ((uint32_t)0x01800000)
#define DMA_SxCR_MBURST_0_MORT                    ((uint32_t)0x00800000)
#define DMA_SxCR_MBURST_1_MORT                    ((uint32_t)0x01000000)
#define DMA_SxCR_PBURST_MORT                      ((uint32_t)0x00600000)
#define DMA_SxCR_PBURST_0_MORT                    ((uint32_t)0x00200000)
#define DMA_SxCR_PBURST_1_MORT                    ((uint32_t)0x00400000)
#define DMA_SxCR_ACK_MORT                         ((uint32_t)0x00100000)
#define DMA_SxCR_CT_MORT                          ((uint32_t)0x00080000)  
#define DMA_SxCR_DBM_MORT                         ((uint32_t)0x00040000)
#define DMA_SxCR_PL_MORT                          ((uint32_t)0x00030000)
#define DMA_SxCR_PL_0_MORT                        ((uint32_t)0x00010000)
#define DMA_SxCR_PL_1_MORT                        ((uint32_t)0x00020000)
#define DMA_SxCR_PINCOS_MORT                      ((uint32_t)0x00008000)
#define DMA_SxCR_MSIZE_MORT                       ((uint32_t)0x00006000)
#define DMA_SxCR_MSIZE_0_MORT                     ((uint32_t)0x00002000)
#define DMA_SxCR_MSIZE_1_MORT                     ((uint32_t)0x00004000)
#define DMA_SxCR_PSIZE_MORT                       ((uint32_t)0x00001800)
#define DMA_SxCR_PSIZE_0_MORT                     ((uint32_t)0x00000800)
#define DMA_SxCR_PSIZE_1_MORT                     ((uint32_t)0x00001000)
#define DMA_SxCR_MINC_MORT                        ((uint32_t)0x00000400)
#define DMA_SxCR_PINC_MORT                        ((uint32_t)0x00000200)
#define DMA_SxCR_CIRC_MORT                        ((uint32_t)0x00000100)
#define DMA_SxCR_DIR_MORT                         ((uint32_t)0x000000C0)
#define DMA_SxCR_DIR_0_MORT                       ((uint32_t)0x00000040)
#define DMA_SxCR_DIR_1_MORT                       ((uint32_t)0x00000080)
#define DMA_SxCR_PFCTRL_MORT                      ((uint32_t)0x00000020)
#define DMA_SxCR_TCIE_MORT                        ((uint32_t)0x00000010)
#define DMA_SxCR_HTIE_MORT                        ((uint32_t)0x00000008)
#define DMA_SxCR_TEIE_MORT                        ((uint32_t)0x00000004)
#define DMA_SxCR_DMEIE_MORT                       ((uint32_t)0x00000002)
#define DMA_SxCR_EN_MORT                          ((uint32_t)0x00000001)

/********************  Bits definition for DMA_SxCNDTR register  **************/
#define DMA_SxNDT_MORT                            ((uint32_t)0x0000FFFF)
#define DMA_SxNDT_0_MORT                          ((uint32_t)0x00000001)
#define DMA_SxNDT_1_MORT                          ((uint32_t)0x00000002)
#define DMA_SxNDT_2_MORT                          ((uint32_t)0x00000004)
#define DMA_SxNDT_3_MORT                          ((uint32_t)0x00000008)
#define DMA_SxNDT_4_MORT                          ((uint32_t)0x00000010)
#define DMA_SxNDT_5_MORT                          ((uint32_t)0x00000020)
#define DMA_SxNDT_6_MORT                          ((uint32_t)0x00000040)
#define DMA_SxNDT_7_MORT                          ((uint32_t)0x00000080)
#define DMA_SxNDT_8_MORT                          ((uint32_t)0x00000100)
#define DMA_SxNDT_9_MORT                          ((uint32_t)0x00000200)
#define DMA_SxNDT_10_MORT                         ((uint32_t)0x00000400)
#define DMA_SxNDT_11_MORT                         ((uint32_t)0x00000800)
#define DMA_SxNDT_12_MORT                         ((uint32_t)0x00001000)
#define DMA_SxNDT_13_MORT                         ((uint32_t)0x00002000)
#define DMA_SxNDT_14_MORT                         ((uint32_t)0x00004000)
#define DMA_SxNDT_15_MORT                         ((uint32_t)0x00008000)

/********************  Bits definition for DMA_SxFCR register  ****************/ 
#define DMA_SxFCR_FEIE_MORT                       ((uint32_t)0x00000080)
#define DMA_SxFCR_FS_MORT                         ((uint32_t)0x00000038)
#define DMA_SxFCR_FS_0_MORT                       ((uint32_t)0x00000008)
#define DMA_SxFCR_FS_1_MORT                       ((uint32_t)0x00000010)
#define DMA_SxFCR_FS_2_MORT                       ((uint32_t)0x00000020)
#define DMA_SxFCR_DMDIS_MORT                      ((uint32_t)0x00000004)
#define DMA_SxFCR_FTH_MORT                        ((uint32_t)0x00000003)
#define DMA_SxFCR_FTH_0_MORT                      ((uint32_t)0x00000001)
#define DMA_SxFCR_FTH_1_MORT                      ((uint32_t)0x00000002)

