w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
/********************  Bits definition for DMA_LISR register  *****************/ 
#define DMA_LISR_TCIF3_MORT                       ((uint32_t)0x08000000)
#define DMA_LISR_HTIF3_MORT                       ((uint32_t)0x04000000)
#define DMA_LISR_TEIF3_MORT                       ((uint32_t)0x02000000)
#define DMA_LISR_DMEIF3_MORT                      ((uint32_t)0x01000000)
#define DMA_LISR_FEIF3_MORT                       ((uint32_t)0x00400000)
#define DMA_LISR_TCIF2_MORT                       ((uint32_t)0x00200000)
#define DMA_LISR_HTIF2_MORT                       ((uint32_t)0x00100000)
#define DMA_LISR_TEIF2_MORT                       ((uint32_t)0x00080000)
#define DMA_LISR_DMEIF2_MORT                      ((uint32_t)0x00040000)
#define DMA_LISR_FEIF2_MORT                       ((uint32_t)0x00010000)
#define DMA_LISR_TCIF1_MORT                       ((uint32_t)0x00000800)
#define DMA_LISR_HTIF1_MORT                       ((uint32_t)0x00000400)
#define DMA_LISR_TEIF1_MORT                       ((uint32_t)0x00000200)
#define DMA_LISR_DMEIF1_MORT                      ((uint32_t)0x00000100)
#define DMA_LISR_FEIF1_MORT                       ((uint32_t)0x00000040)
#define DMA_LISR_TCIF0_MORT                       ((uint32_t)0x00000020)
#define DMA_LISR_HTIF0_MORT                       ((uint32_t)0x00000010)
#define DMA_LISR_TEIF0_MORT                       ((uint32_t)0x00000008)
#define DMA_LISR_DMEIF0_MORT                      ((uint32_t)0x00000004)
#define DMA_LISR_FEIF0_MORT                       ((uint32_t)0x00000001)

/********************  Bits definition for DMA_HISR register  *****************/ 
#define DMA_HISR_TCIF7_MORT                       ((uint32_t)0x08000000)
#define DMA_HISR_HTIF7_MORT                       ((uint32_t)0x04000000)
#define DMA_HISR_TEIF7_MORT                       ((uint32_t)0x02000000)
#define DMA_HISR_DMEIF7_MORT                      ((uint32_t)0x01000000)
#define DMA_HISR_FEIF7_MORT                       ((uint32_t)0x00400000)
#define DMA_HISR_TCIF6_MORT                       ((uint32_t)0x00200000)
#define DMA_HISR_HTIF6_MORT                       ((uint32_t)0x00100000)
#define DMA_HISR_TEIF6_MORT                       ((uint32_t)0x00080000)
#define DMA_HISR_DMEIF6_MORT                      ((uint32_t)0x00040000)
#define DMA_HISR_FEIF6_MORT                       ((uint32_t)0x00010000)
#define DMA_HISR_TCIF5_MORT                       ((uint32_t)0x00000800)
#define DMA_HISR_HTIF5_MORT                       ((uint32_t)0x00000400)
#define DMA_HISR_TEIF5_MORT                       ((uint32_t)0x00000200)
#define DMA_HISR_DMEIF5_MORT                      ((uint32_t)0x00000100)
#define DMA_HISR_FEIF5_MORT                       ((uint32_t)0x00000040)
#define DMA_HISR_TCIF4_MORT                       ((uint32_t)0x00000020)
#define DMA_HISR_HTIF4_MORT                       ((uint32_t)0x00000010)
#define DMA_HISR_TEIF4_MORT                       ((uint32_t)0x00000008)
#define DMA_HISR_DMEIF4_MORT                      ((uint32_t)0x00000004)
#define DMA_HISR_FEIF4_MORT                       ((uint32_t)0x00000001)

/********************  Bits definition for DMA_LIFCR register  ****************/ 
#define DMA_LIFCR_CTCIF3_MORT                     ((uint32_t)0x08000000)
#define DMA_LIFCR_CHTIF3_MORT                     ((uint32_t)0x04000000)
#define DMA_LIFCR_CTEIF3_MORT                     ((uint32_t)0x02000000)
#define DMA_LIFCR_CDMEIF3_MORT                    ((uint32_t)0x01000000)
#define DMA_LIFCR_CFEIF3_MORT                     ((uint32_t)0x00400000)
#define DMA_LIFCR_CTCIF2_MORT                     ((uint32_t)0x00200000)
#define DMA_LIFCR_CHTIF2_MORT                     ((uint32_t)0x00100000)
#define DMA_LIFCR_CTEIF2_MORT                     ((uint32_t)0x00080000)
#define DMA_LIFCR_CDMEIF2_MORT                    ((uint32_t)0x00040000)
#define DMA_LIFCR_CFEIF2_MORT                     ((uint32_t)0x00010000)
#define DMA_LIFCR_CTCIF1_MORT                     ((uint32_t)0x00000800)
#define DMA_LIFCR_CHTIF1_MORT                     ((uint32_t)0x00000400)
#define DMA_LIFCR_CTEIF1_MORT                     ((uint32_t)0x00000200)
#define DMA_LIFCR_CDMEIF1_MORT                    ((uint32_t)0x00000100)
#define DMA_LIFCR_CFEIF1_MORT                     ((uint32_t)0x00000040)
#define DMA_LIFCR_CTCIF0_MORT                     ((uint32_t)0x00000020)
#define DMA_LIFCR_CHTIF0_MORT                     ((uint32_t)0x00000010)
#define DMA_LIFCR_CTEIF0_MORT                     ((uint32_t)0x00000008)
#define DMA_LIFCR_CDMEIF0_MORT                    ((uint32_t)0x00000004)
#define DMA_LIFCR_CFEIF0_MORT                     ((uint32_t)0x00000001)

/********************  Bits definition for DMA_HIFCR  register  ****************/ 
#define DMA_HIFCR_CTCIF7_MORT                     ((uint32_t)0x08000000)
#define DMA_HIFCR_CHTIF7_MORT                     ((uint32_t)0x04000000)
#define DMA_HIFCR_CTEIF7_MORT                     ((uint32_t)0x02000000)
#define DMA_HIFCR_CDMEIF7_MORT                    ((uint32_t)0x01000000)
#define DMA_HIFCR_CFEIF7_MORT                     ((uint32_t)0x00400000)
#define DMA_HIFCR_CTCIF6_MORT                     ((uint32_t)0x00200000)
#define DMA_HIFCR_CHTIF6_MORT                     ((uint32_t)0x00100000)
#define DMA_HIFCR_CTEIF6_MORT                     ((uint32_t)0x00080000)
#define DMA_HIFCR_CDMEIF6_MORT                    ((uint32_t)0x00040000)
#define DMA_HIFCR_CFEIF6_MORT                     ((uint32_t)0x00010000)
#define DMA_HIFCR_CTCIF5_MORT                     ((uint32_t)0x00000800)
#define DMA_HIFCR_CHTIF5_MORT                     ((uint32_t)0x00000400)
#define DMA_HIFCR_CTEIF5_MORT                     ((uint32_t)0x00000200)
#define DMA_HIFCR_CDMEIF5_MORT                    ((uint32_t)0x00000100)
#define DMA_HIFCR_CFEIF5_MORT                     ((uint32_t)0x00000040)
#define DMA_HIFCR_CTCIF4_MORT                     ((uint32_t)0x00000020)
#define DMA_HIFCR_CHTIF4_MORT                     ((uint32_t)0x00000010)
#define DMA_HIFCR_CTEIF4_MORT                     ((uint32_t)0x00000008)
#define DMA_HIFCR_CDMEIF4_MORT                    ((uint32_t)0x00000004)
#define DMA_HIFCR_CFEIF4_MORT                     ((uint32_t)0x00000001)

/******************************************************************************/
/*                                                                            */
/*                         AHB Master DMA2D_MORT Controller (DMA2D_MORT)                */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for DMA2D_CR register  ******************/

#define DMA2D_CR_START_MORT                     ((uint32_t)0x00000001)               /*!< Start transfer */
#define DMA2D_CR_SUSP_MORT                      ((uint32_t)0x00000002)               /*!< Suspend transfer */
#define DMA2D_CR_ABORT_MORT                     ((uint32_t)0x00000004)               /*!< Abort transfer */
#define DMA2D_CR_TEIE_MORT                      ((uint32_t)0x00000100)               /*!< Transfer Error Interrupt Enable */
#define DMA2D_CR_TCIE_MORT                      ((uint32_t)0x00000200)               /*!< Transfer Complete Interrupt Enable */
#define DMA2D_CR_TWIE_MORT                      ((uint32_t)0x00000400)               /*!< Transfer Watermark Interrupt Enable */
#define DMA2D_CR_CAEIE_MORT                     ((uint32_t)0x00000800)               /*!< CLUT Access Error Interrupt Enable */
#define DMA2D_CR_CTCIE_MORT                     ((uint32_t)0x00001000)               /*!< CLUT Transfer Complete Interrupt Enable */
#define DMA2D_CR_CEIE_MORT                      ((uint32_t)0x00002000)               /*!< Configuration Error Interrupt Enable */
#define DMA2D_CR_MODE_MORT                      ((uint32_t)0x00030000)               /*!< DMA2D_MORT Mode */

/********************  Bit definition for DMA2D_ISR register  *****************/

#define DMA2D_ISR_TEIF_MORT                     ((uint32_t)0x00000001)               /*!< Transfer Error Interrupt Flag */
#define DMA2D_ISR_TCIF_MORT                     ((uint32_t)0x00000002)               /*!< Transfer Complete Interrupt Flag */
#define DMA2D_ISR_TWIF_MORT                     ((uint32_t)0x00000004)               /*!< Transfer Watermark Interrupt Flag */
#define DMA2D_ISR_CAEIF_MORT                    ((uint32_t)0x00000008)               /*!< CLUT Access Error Interrupt Flag */
#define DMA2D_ISR_CTCIF_MORT                    ((uint32_t)0x00000010)               /*!< CLUT Transfer Complete Interrupt Flag */
#define DMA2D_ISR_CEIF_MORT                     ((uint32_t)0x00000020)               /*!< Configuration Error Interrupt Flag */

