w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
/*******************  Bits definition for FLASH_CR register  ******************/

/*******************  Bits definition for FLASH_OPTCR register  ***************/

/******************  Bits definition for FLASH_OPTCR1 register  ***************/

#if defined(STM32F40_41xxx) || defined(STM32F412xG) || defined(STM32F413_423xx)
/******************************************************************************/
/*                                                                            */
/*                       Flexible Static Memory Controller                    */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for FSMC_BCR1 register  *******************/


/******************  Bit definition for FSMC_BCR2 register  *******************/


/******************  Bit definition for FSMC_BCR3 register  *******************/


/******************  Bit definition for FSMC_BCR4 register  *******************/


/******************  Bit definition for FSMC_BTR1 register  ******************/


/******************  Bit definition for FSMC_BTR2 register  *******************/


/*******************  Bit definition for FSMC_BTR3 register  *******************/



/******************  Bit definition for FSMC_BTR4 register  *******************/


/******************  Bit definition for FSMC_BWTR1 register  ******************/


/******************  Bit definition for FSMC_BWTR2 register  ******************/


/******************  Bit definition for FSMC_BWTR3 register  ******************/


/******************  Bit definition for FSMC_BWTR4 register  ******************/


/******************  Bit definition for FSMC_PCR2 register  *******************/


/******************  Bit definition for FSMC_PCR3 register  *******************/


/******************  Bit definition for FSMC_PCR4 register  *******************/


/*******************  Bit definition for FSMC_SR2 register  *******************/


/*******************  Bit definition for FSMC_SR3 register  *******************/


/*******************  Bit definition for FSMC_SR4 register  *******************/

/******************  Bit definition for FSMC_PMEM2 register  ******************/


/******************  Bit definition for FSMC_PMEM3 register  ******************/


/******************  Bit definition for FSMC_PMEM4 register  ******************/


/******************  Bit definition for FSMC_PATT2 register  ******************/


/******************  Bit definition for FSMC_PATT3 register  ******************/


/******************  Bit definition for FSMC_PATT4 register  ******************/

/******************  Bit definition for FSMC_PIO4 register  *******************/


/******************  Bit definition for FSMC_ECCR2 register  ******************/


/******************  Bit definition for FSMC_ECCR3 register  ******************/

#endif /* STM32F40_41xxx || STM32F412xG || STM32F413_423xx */

#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F446xx_MORT) || defined(STM32F469_479xx)
/******************************************************************************/
/*                                                                            */
/*                          Flexible Memory Controller                        */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for FMC_BCR1 register  *******************/

/******************  Bit definition for FMC_BCR2 register  *******************/

/******************  Bit definition for FMC_BCR3 register  *******************/

/******************  Bit definition for FMC_BCR4 register  *******************/

/******************  Bit definition for FMC_BTR1 register  ******************/


/******************  Bit definition for FMC_BTR2 register  *******************/


/*******************  Bit definition for FMC_BTR3 register  *******************/

/******************  Bit definition for FMC_BTR4 register  *******************/


/******************  Bit definition for FMC_BWTR1 register  ******************/

/******************  Bit definition for FMC_BWTR2 register  ******************/

/******************  Bit definition for FMC_BWTR3 register  ******************/

/******************  Bit definition for FMC_BWTR4 register  ******************/

/******************  Bit definition for FMC_PCR2 register  *******************/

/******************  Bit definition for FMC_PCR3 register  *******************/

/******************  Bit definition for FMC_PCR4 register  *******************/

/*******************  Bit definition for FMC_SR2 register  *******************/

/*******************  Bit definition for FMC_SR3 register  *******************/

/*******************  Bit definition for FMC_SR4 register  *******************/

/******************  Bit definition for FMC_PMEM2 register  ******************/


/******************  Bit definition for FMC_PMEM3 register  ******************/

/******************  Bit definition for FMC_PMEM4 register  ******************/

/******************  Bit definition for FMC_PATT2 register  ******************/

/******************  Bit definition for FMC_PATT3 register  ******************/

/******************  Bit definition for FMC_PATT4 register  ******************/

/******************  Bit definition for FMC_PIO4 register  *******************/

/******************  Bit definition for FMC_ECCR2 register  ******************/

/******************  Bit definition for FMC_ECCR3 register  ******************/

/******************  Bit definition for FMC_SDCR1 register  ******************/

/******************  Bit definition for FMC_SDCR2 register  ******************/

/******************  Bit definition for FMC_SDTR1 register  ******************/

/******************  Bit definition for FMC_SDTR2 register  ******************/

