w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
/******************  Bit definition for FMC_SDCMR register  ******************/

/******************  Bit definition for FMC_SDRTR register  ******************/

/******************  Bit definition for FMC_SDSR register  ******************/

#endif /* STM32F427_437xx ||  STM32F429_439xx || STM32F446xx_MORT || STM32F469_479xx */

/******************************************************************************/
/*                                                                            */
/*                            General Purpose I/O                             */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for GPIO_MODER register  *****************/
#define GPIO_MODER_MODER0_MORT                    ((uint32_t)0x00000003)
#define GPIO_MODER_MODER0_0_MORT                  ((uint32_t)0x00000001)
#define GPIO_MODER_MODER0_1_MORT                  ((uint32_t)0x00000002)

#define GPIO_MODER_MODER1_MORT                    ((uint32_t)0x0000000C)
#define GPIO_MODER_MODER1_0_MORT                  ((uint32_t)0x00000004)
#define GPIO_MODER_MODER1_1_MORT                  ((uint32_t)0x00000008)

#define GPIO_MODER_MODER2_MORT                    ((uint32_t)0x00000030)
#define GPIO_MODER_MODER2_0_MORT                  ((uint32_t)0x00000010)
#define GPIO_MODER_MODER2_1_MORT                  ((uint32_t)0x00000020)

#define GPIO_MODER_MODER3_MORT                    ((uint32_t)0x000000C0)
#define GPIO_MODER_MODER3_0_MORT                  ((uint32_t)0x00000040)
#define GPIO_MODER_MODER3_1_MORT                  ((uint32_t)0x00000080)

#define GPIO_MODER_MODER4_MORT                    ((uint32_t)0x00000300)
#define GPIO_MODER_MODER4_0_MORT                  ((uint32_t)0x00000100)
#define GPIO_MODER_MODER4_1_MORT                  ((uint32_t)0x00000200)

#define GPIO_MODER_MODER5_MORT                    ((uint32_t)0x00000C00)
#define GPIO_MODER_MODER5_0_MORT                  ((uint32_t)0x00000400)
#define GPIO_MODER_MODER5_1_MORT                  ((uint32_t)0x00000800)

#define GPIO_MODER_MODER6_MORT                    ((uint32_t)0x00003000)
#define GPIO_MODER_MODER6_0_MORT                  ((uint32_t)0x00001000)
#define GPIO_MODER_MODER6_1_MORT                  ((uint32_t)0x00002000)

#define GPIO_MODER_MODER7_MORT                    ((uint32_t)0x0000C000)
#define GPIO_MODER_MODER7_0_MORT                  ((uint32_t)0x00004000)
#define GPIO_MODER_MODER7_1_MORT                  ((uint32_t)0x00008000)

#define GPIO_MODER_MODER8_MORT                    ((uint32_t)0x00030000)
#define GPIO_MODER_MODER8_0_MORT                  ((uint32_t)0x00010000)
#define GPIO_MODER_MODER8_1_MORT                  ((uint32_t)0x00020000)

#define GPIO_MODER_MODER9_MORT                    ((uint32_t)0x000C0000)
#define GPIO_MODER_MODER9_0_MORT                  ((uint32_t)0x00040000)
#define GPIO_MODER_MODER9_1_MORT                  ((uint32_t)0x00080000)

#define GPIO_MODER_MODER10_MORT                   ((uint32_t)0x00300000)
#define GPIO_MODER_MODER10_0_MORT                 ((uint32_t)0x00100000)
#define GPIO_MODER_MODER10_1_MORT                 ((uint32_t)0x00200000)

#define GPIO_MODER_MODER11_MORT                   ((uint32_t)0x00C00000)
#define GPIO_MODER_MODER11_0_MORT                 ((uint32_t)0x00400000)
#define GPIO_MODER_MODER11_1_MORT                 ((uint32_t)0x00800000)

#define GPIO_MODER_MODER12_MORT                   ((uint32_t)0x03000000)
#define GPIO_MODER_MODER12_0_MORT                 ((uint32_t)0x01000000)
#define GPIO_MODER_MODER12_1_MORT                 ((uint32_t)0x02000000)

#define GPIO_MODER_MODER13_MORT                   ((uint32_t)0x0C000000)
#define GPIO_MODER_MODER13_0_MORT                 ((uint32_t)0x04000000)
#define GPIO_MODER_MODER13_1_MORT                 ((uint32_t)0x08000000)

#define GPIO_MODER_MODER14_MORT                   ((uint32_t)0x30000000)
#define GPIO_MODER_MODER14_0_MORT                 ((uint32_t)0x10000000)
#define GPIO_MODER_MODER14_1_MORT                 ((uint32_t)0x20000000)

#define GPIO_MODER_MODER15_MORT                   ((uint32_t)0xC0000000)
#define GPIO_MODER_MODER15_0_MORT                 ((uint32_t)0x40000000)
#define GPIO_MODER_MODER15_1_MORT                 ((uint32_t)0x80000000)

/******************  Bits definition for GPIO_OTYPER register  ****************/
#define GPIO_OTYPER_OT_0_MORT                     ((uint32_t)0x00000001)
#define GPIO_OTYPER_OT_1_MORT                     ((uint32_t)0x00000002)
#define GPIO_OTYPER_OT_2_MORT                     ((uint32_t)0x00000004)
#define GPIO_OTYPER_OT_3_MORT                     ((uint32_t)0x00000008)
#define GPIO_OTYPER_OT_4_MORT                     ((uint32_t)0x00000010)
#define GPIO_OTYPER_OT_5_MORT                     ((uint32_t)0x00000020)
#define GPIO_OTYPER_OT_6_MORT                     ((uint32_t)0x00000040)
#define GPIO_OTYPER_OT_7_MORT                     ((uint32_t)0x00000080)
#define GPIO_OTYPER_OT_8_MORT                     ((uint32_t)0x00000100)
#define GPIO_OTYPER_OT_9_MORT                     ((uint32_t)0x00000200)
#define GPIO_OTYPER_OT_10_MORT                    ((uint32_t)0x00000400)
#define GPIO_OTYPER_OT_11_MORT                    ((uint32_t)0x00000800)
#define GPIO_OTYPER_OT_12_MORT                    ((uint32_t)0x00001000)
#define GPIO_OTYPER_OT_13_MORT                    ((uint32_t)0x00002000)
#define GPIO_OTYPER_OT_14_MORT                    ((uint32_t)0x00004000)
#define GPIO_OTYPER_OT_15_MORT                    ((uint32_t)0x00008000)

/******************  Bits definition for GPIO_OSPEEDR register  ***************/
#define GPIO_OSPEEDER_OSPEEDR0_MORT               ((uint32_t)0x00000003)
#define GPIO_OSPEEDER_OSPEEDR0_0_MORT             ((uint32_t)0x00000001)
#define GPIO_OSPEEDER_OSPEEDR0_1_MORT             ((uint32_t)0x00000002)

#define GPIO_OSPEEDER_OSPEEDR1_MORT               ((uint32_t)0x0000000C)
#define GPIO_OSPEEDER_OSPEEDR1_0_MORT             ((uint32_t)0x00000004)
#define GPIO_OSPEEDER_OSPEEDR1_1_MORT             ((uint32_t)0x00000008)

#define GPIO_OSPEEDER_OSPEEDR2_MORT               ((uint32_t)0x00000030)
#define GPIO_OSPEEDER_OSPEEDR2_0_MORT             ((uint32_t)0x00000010)
#define GPIO_OSPEEDER_OSPEEDR2_1_MORT             ((uint32_t)0x00000020)

