w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
#define GPIO_OSPEEDER_OSPEEDR3_MORT               ((uint32_t)0x000000C0)
#define GPIO_OSPEEDER_OSPEEDR3_0_MORT             ((uint32_t)0x00000040)
#define GPIO_OSPEEDER_OSPEEDR3_1_MORT             ((uint32_t)0x00000080)

#define GPIO_OSPEEDER_OSPEEDR4_MORT               ((uint32_t)0x00000300)
#define GPIO_OSPEEDER_OSPEEDR4_0_MORT             ((uint32_t)0x00000100)
#define GPIO_OSPEEDER_OSPEEDR4_1_MORT             ((uint32_t)0x00000200)

#define GPIO_OSPEEDER_OSPEEDR5_MORT               ((uint32_t)0x00000C00)
#define GPIO_OSPEEDER_OSPEEDR5_0_MORT             ((uint32_t)0x00000400)
#define GPIO_OSPEEDER_OSPEEDR5_1_MORT             ((uint32_t)0x00000800)

#define GPIO_OSPEEDER_OSPEEDR6_MORT               ((uint32_t)0x00003000)
#define GPIO_OSPEEDER_OSPEEDR6_0_MORT             ((uint32_t)0x00001000)
#define GPIO_OSPEEDER_OSPEEDR6_1_MORT             ((uint32_t)0x00002000)

#define GPIO_OSPEEDER_OSPEEDR7_MORT               ((uint32_t)0x0000C000)
#define GPIO_OSPEEDER_OSPEEDR7_0_MORT             ((uint32_t)0x00004000)
#define GPIO_OSPEEDER_OSPEEDR7_1_MORT             ((uint32_t)0x00008000)

#define GPIO_OSPEEDER_OSPEEDR8_MORT               ((uint32_t)0x00030000)
#define GPIO_OSPEEDER_OSPEEDR8_0_MORT             ((uint32_t)0x00010000)
#define GPIO_OSPEEDER_OSPEEDR8_1_MORT             ((uint32_t)0x00020000)

#define GPIO_OSPEEDER_OSPEEDR9_MORT               ((uint32_t)0x000C0000)
#define GPIO_OSPEEDER_OSPEEDR9_0_MORT             ((uint32_t)0x00040000)
#define GPIO_OSPEEDER_OSPEEDR9_1_MORT             ((uint32_t)0x00080000)

#define GPIO_OSPEEDER_OSPEEDR10_MORT              ((uint32_t)0x00300000)
#define GPIO_OSPEEDER_OSPEEDR10_0_MORT            ((uint32_t)0x00100000)
#define GPIO_OSPEEDER_OSPEEDR10_1_MORT            ((uint32_t)0x00200000)

#define GPIO_OSPEEDER_OSPEEDR11_MORT              ((uint32_t)0x00C00000)
#define GPIO_OSPEEDER_OSPEEDR11_0_MORT            ((uint32_t)0x00400000)
#define GPIO_OSPEEDER_OSPEEDR11_1_MORT            ((uint32_t)0x00800000)

#define GPIO_OSPEEDER_OSPEEDR12_MORT              ((uint32_t)0x03000000)
#define GPIO_OSPEEDER_OSPEEDR12_0_MORT            ((uint32_t)0x01000000)
#define GPIO_OSPEEDER_OSPEEDR12_1_MORT            ((uint32_t)0x02000000)

#define GPIO_OSPEEDER_OSPEEDR13_MORT              ((uint32_t)0x0C000000)
#define GPIO_OSPEEDER_OSPEEDR13_0_MORT            ((uint32_t)0x04000000)
#define GPIO_OSPEEDER_OSPEEDR13_1_MORT            ((uint32_t)0x08000000)

#define GPIO_OSPEEDER_OSPEEDR14_MORT              ((uint32_t)0x30000000)
#define GPIO_OSPEEDER_OSPEEDR14_0_MORT            ((uint32_t)0x10000000)
#define GPIO_OSPEEDER_OSPEEDR14_1_MORT            ((uint32_t)0x20000000)

#define GPIO_OSPEEDER_OSPEEDR15_MORT              ((uint32_t)0xC0000000)
#define GPIO_OSPEEDER_OSPEEDR15_0_MORT            ((uint32_t)0x40000000)
#define GPIO_OSPEEDER_OSPEEDR15_1_MORT            ((uint32_t)0x80000000)

/******************  Bits definition for GPIO_PUPDR register  *****************/
#define GPIO_PUPDR_PUPDR0_MORT                    ((uint32_t)0x00000003)
#define GPIO_PUPDR_PUPDR0_0_MORT                  ((uint32_t)0x00000001)
#define GPIO_PUPDR_PUPDR0_1_MORT                  ((uint32_t)0x00000002)

#define GPIO_PUPDR_PUPDR1_MORT                    ((uint32_t)0x0000000C)
#define GPIO_PUPDR_PUPDR1_0_MORT                  ((uint32_t)0x00000004)
#define GPIO_PUPDR_PUPDR1_1_MORT                  ((uint32_t)0x00000008)

#define GPIO_PUPDR_PUPDR2_MORT                    ((uint32_t)0x00000030)
#define GPIO_PUPDR_PUPDR2_0_MORT                  ((uint32_t)0x00000010)
#define GPIO_PUPDR_PUPDR2_1_MORT                  ((uint32_t)0x00000020)

#define GPIO_PUPDR_PUPDR3_MORT                    ((uint32_t)0x000000C0)
#define GPIO_PUPDR_PUPDR3_0_MORT                  ((uint32_t)0x00000040)
#define GPIO_PUPDR_PUPDR3_1_MORT                  ((uint32_t)0x00000080)

#define GPIO_PUPDR_PUPDR4_MORT                    ((uint32_t)0x00000300)
#define GPIO_PUPDR_PUPDR4_0_MORT                  ((uint32_t)0x00000100)
#define GPIO_PUPDR_PUPDR4_1_MORT                  ((uint32_t)0x00000200)

#define GPIO_PUPDR_PUPDR5_MORT                    ((uint32_t)0x00000C00)
#define GPIO_PUPDR_PUPDR5_0_MORT                  ((uint32_t)0x00000400)
#define GPIO_PUPDR_PUPDR5_1_MORT                  ((uint32_t)0x00000800)

#define GPIO_PUPDR_PUPDR6_MORT                    ((uint32_t)0x00003000)
#define GPIO_PUPDR_PUPDR6_0_MORT                  ((uint32_t)0x00001000)
#define GPIO_PUPDR_PUPDR6_1_MORT                  ((uint32_t)0x00002000)

#define GPIO_PUPDR_PUPDR7_MORT                    ((uint32_t)0x0000C000)
#define GPIO_PUPDR_PUPDR7_0_MORT                  ((uint32_t)0x00004000)
#define GPIO_PUPDR_PUPDR7_1_MORT                  ((uint32_t)0x00008000)

#define GPIO_PUPDR_PUPDR8_MORT                    ((uint32_t)0x00030000)
#define GPIO_PUPDR_PUPDR8_0_MORT                  ((uint32_t)0x00010000)
#define GPIO_PUPDR_PUPDR8_1_MORT                  ((uint32_t)0x00020000)

#define GPIO_PUPDR_PUPDR9_MORT                    ((uint32_t)0x000C0000)
#define GPIO_PUPDR_PUPDR9_0_MORT                  ((uint32_t)0x00040000)
#define GPIO_PUPDR_PUPDR9_1_MORT                  ((uint32_t)0x00080000)

#define GPIO_PUPDR_PUPDR10_MORT                   ((uint32_t)0x00300000)
#define GPIO_PUPDR_PUPDR10_0_MORT                 ((uint32_t)0x00100000)
#define GPIO_PUPDR_PUPDR10_1_MORT                 ((uint32_t)0x00200000)

#define GPIO_PUPDR_PUPDR11_MORT                   ((uint32_t)0x00C00000)
#define GPIO_PUPDR_PUPDR11_0_MORT                 ((uint32_t)0x00400000)
#define GPIO_PUPDR_PUPDR11_1_MORT                 ((uint32_t)0x00800000)

#define GPIO_PUPDR_PUPDR12_MORT                   ((uint32_t)0x03000000)
#define GPIO_PUPDR_PUPDR12_0_MORT                 ((uint32_t)0x01000000)
#define GPIO_PUPDR_PUPDR12_1_MORT                 ((uint32_t)0x02000000)

#define GPIO_PUPDR_PUPDR13_MORT                   ((uint32_t)0x0C000000)
#define GPIO_PUPDR_PUPDR13_0_MORT                 ((uint32_t)0x04000000)
#define GPIO_PUPDR_PUPDR13_1_MORT                 ((uint32_t)0x08000000)

