w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
#define GPIO_PUPDR_PUPDR14_MORT                   ((uint32_t)0x30000000)
#define GPIO_PUPDR_PUPDR14_0_MORT                 ((uint32_t)0x10000000)
#define GPIO_PUPDR_PUPDR14_1_MORT                 ((uint32_t)0x20000000)

#define GPIO_PUPDR_PUPDR15_MORT                   ((uint32_t)0xC0000000)
#define GPIO_PUPDR_PUPDR15_0_MORT                 ((uint32_t)0x40000000)
#define GPIO_PUPDR_PUPDR15_1_MORT                 ((uint32_t)0x80000000)

/******************  Bits definition for GPIO_IDR register  *******************/
#define GPIO_IDR_IDR_0_MORT                       ((uint32_t)0x00000001)
#define GPIO_IDR_IDR_1_MORT                       ((uint32_t)0x00000002)
#define GPIO_IDR_IDR_2_MORT                       ((uint32_t)0x00000004)
#define GPIO_IDR_IDR_3_MORT                       ((uint32_t)0x00000008)
#define GPIO_IDR_IDR_4_MORT                       ((uint32_t)0x00000010)
#define GPIO_IDR_IDR_5_MORT                       ((uint32_t)0x00000020)
#define GPIO_IDR_IDR_6_MORT                       ((uint32_t)0x00000040)
#define GPIO_IDR_IDR_7_MORT                       ((uint32_t)0x00000080)
#define GPIO_IDR_IDR_8_MORT                       ((uint32_t)0x00000100)
#define GPIO_IDR_IDR_9_MORT                       ((uint32_t)0x00000200)
#define GPIO_IDR_IDR_10_MORT                      ((uint32_t)0x00000400)
#define GPIO_IDR_IDR_11_MORT                      ((uint32_t)0x00000800)
#define GPIO_IDR_IDR_12_MORT                      ((uint32_t)0x00001000)
#define GPIO_IDR_IDR_13_MORT                      ((uint32_t)0x00002000)
#define GPIO_IDR_IDR_14_MORT                      ((uint32_t)0x00004000)
#define GPIO_IDR_IDR_15_MORT                      ((uint32_t)0x00008000)
/* Old GPIO_IDR register bits definition, maintained for legacy purpose */
#define GPIO_OTYPER_IDR_0_MORT                    GPIO_IDR_IDR_0_MORT
#define GPIO_OTYPER_IDR_1_MORT                    GPIO_IDR_IDR_1_MORT
#define GPIO_OTYPER_IDR_2_MORT                    GPIO_IDR_IDR_2_MORT
#define GPIO_OTYPER_IDR_3_MORT                    GPIO_IDR_IDR_3_MORT
#define GPIO_OTYPER_IDR_4_MORT                    GPIO_IDR_IDR_4_MORT
#define GPIO_OTYPER_IDR_5_MORT                    GPIO_IDR_IDR_5_MORT
#define GPIO_OTYPER_IDR_6_MORT                    GPIO_IDR_IDR_6_MORT
#define GPIO_OTYPER_IDR_7_MORT                    GPIO_IDR_IDR_7_MORT
#define GPIO_OTYPER_IDR_8_MORT                    GPIO_IDR_IDR_8_MORT
#define GPIO_OTYPER_IDR_9_MORT                    GPIO_IDR_IDR_9_MORT
#define GPIO_OTYPER_IDR_10_MORT                   GPIO_IDR_IDR_10_MORT
#define GPIO_OTYPER_IDR_11_MORT                   GPIO_IDR_IDR_11_MORT
#define GPIO_OTYPER_IDR_12_MORT                   GPIO_IDR_IDR_12_MORT
#define GPIO_OTYPER_IDR_13_MORT                   GPIO_IDR_IDR_13_MORT
#define GPIO_OTYPER_IDR_14_MORT                   GPIO_IDR_IDR_14_MORT
#define GPIO_OTYPER_IDR_15_MORT                   GPIO_IDR_IDR_15_MORT

/******************  Bits definition for GPIO_ODR register  *******************/
#define GPIO_ODR_ODR_0_MORT                       ((uint32_t)0x00000001)
#define GPIO_ODR_ODR_1_MORT                       ((uint32_t)0x00000002)
#define GPIO_ODR_ODR_2_MORT                       ((uint32_t)0x00000004)
#define GPIO_ODR_ODR_3_MORT                       ((uint32_t)0x00000008)
#define GPIO_ODR_ODR_4_MORT                       ((uint32_t)0x00000010)
#define GPIO_ODR_ODR_5_MORT                       ((uint32_t)0x00000020)
#define GPIO_ODR_ODR_6_MORT                       ((uint32_t)0x00000040)
#define GPIO_ODR_ODR_7_MORT                       ((uint32_t)0x00000080)
#define GPIO_ODR_ODR_8_MORT                       ((uint32_t)0x00000100)
#define GPIO_ODR_ODR_9_MORT                       ((uint32_t)0x00000200)
#define GPIO_ODR_ODR_10_MORT                      ((uint32_t)0x00000400)
#define GPIO_ODR_ODR_11_MORT                      ((uint32_t)0x00000800)
#define GPIO_ODR_ODR_12_MORT                      ((uint32_t)0x00001000)
#define GPIO_ODR_ODR_13_MORT                      ((uint32_t)0x00002000)
#define GPIO_ODR_ODR_14_MORT                      ((uint32_t)0x00004000)
#define GPIO_ODR_ODR_15_MORT                      ((uint32_t)0x00008000)
/* Old GPIO_ODR register bits definition, maintained for legacy purpose */
/*#define GPIO_OTYPER_ODR_0                    GPIO_ODR_ODR_0_MORT
#define GPIO_OTYPER_ODR_1                    GPIO_ODR_ODR_1_MORT
#define GPIO_OTYPER_ODR_2                    GPIO_ODR_ODR_2_MORT
#define GPIO_OTYPER_ODR_3                    GPIO_ODR_ODR_3_MORT
#define GPIO_OTYPER_ODR_4                    GPIO_ODR_ODR_4_MORT
#define GPIO_OTYPER_ODR_5                    GPIO_ODR_ODR_5_MORT
#define GPIO_OTYPER_ODR_6                    GPIO_ODR_ODR_6_MORT
#define GPIO_OTYPER_ODR_7                    GPIO_ODR_ODR_7_MORT
#define GPIO_OTYPER_ODR_8                    GPIO_ODR_ODR_8_MORT
#define GPIO_OTYPER_ODR_9                    GPIO_ODR_ODR_9_MORT
#define GPIO_OTYPER_ODR_10                   GPIO_ODR_ODR_10_MORT
#define GPIO_OTYPER_ODR_11                   GPIO_ODR_ODR_11_MORT
#define GPIO_OTYPER_ODR_12                   GPIO_ODR_ODR_12_MORT
#define GPIO_OTYPER_ODR_13                   GPIO_ODR_ODR_13_MORT
#define GPIO_OTYPER_ODR_14                   GPIO_ODR_ODR_14_MORT
#define GPIO_OTYPER_ODR_15                   GPIO_ODR_ODR_15_MORT*/

/******************  Bits definition for GPIO_BSRR register  ******************/
#define GPIO_BSRR_BS_0_MORT                       ((uint32_t)0x00000001)
#define GPIO_BSRR_BS_1_MORT                       ((uint32_t)0x00000002)
#define GPIO_BSRR_BS_2_MORT                       ((uint32_t)0x00000004)
#define GPIO_BSRR_BS_3_MORT                       ((uint32_t)0x00000008)
#define GPIO_BSRR_BS_4_MORT                       ((uint32_t)0x00000010)
#define GPIO_BSRR_BS_5_MORT                       ((uint32_t)0x00000020)
#define GPIO_BSRR_BS_6_MORT                       ((uint32_t)0x00000040)
#define GPIO_BSRR_BS_7_MORT                       ((uint32_t)0x00000080)
#define GPIO_BSRR_BS_8_MORT                       ((uint32_t)0x00000100)
#define GPIO_BSRR_BS_9_MORT                       ((uint32_t)0x00000200)
#define GPIO_BSRR_BS_10_MORT                      ((uint32_t)0x00000400)
#define GPIO_BSRR_BS_11_MORT                      ((uint32_t)0x00000800)
#define GPIO_BSRR_BS_12_MORT                      ((uint32_t)0x00001000)
#define GPIO_BSRR_BS_13_MORT                      ((uint32_t)0x00002000)
#define GPIO_BSRR_BS_14_MORT                      ((uint32_t)0x00004000)
#define GPIO_BSRR_BS_15_MORT                      ((uint32_t)0x00008000)
#define GPIO_BSRR_BR_0_MORT                       ((uint32_t)0x00010000)
#define GPIO_BSRR_BR_1_MORT                       ((uint32_t)0x00020000)
#define GPIO_BSRR_BR_2_MORT                       ((uint32_t)0x00040000)
#define GPIO_BSRR_BR_3_MORT                       ((uint32_t)0x00080000)
#define GPIO_BSRR_BR_4_MORT                       ((uint32_t)0x00100000)
#define GPIO_BSRR_BR_5_MORT                       ((uint32_t)0x00200000)
#define GPIO_BSRR_BR_6_MORT                       ((uint32_t)0x00400000)
#define GPIO_BSRR_BR_7_MORT                       ((uint32_t)0x00800000)
#define GPIO_BSRR_BR_8_MORT                       ((uint32_t)0x01000000)
#define GPIO_BSRR_BR_9_MORT                       ((uint32_t)0x02000000)
#define GPIO_BSRR_BR_10_MORT                      ((uint32_t)0x04000000)
#define GPIO_BSRR_BR_11_MORT                      ((uint32_t)0x08000000)
#define GPIO_BSRR_BR_12_MORT                      ((uint32_t)0x10000000)
#define GPIO_BSRR_BR_13_MORT                      ((uint32_t)0x20000000)
#define GPIO_BSRR_BR_14_MORT                      ((uint32_t)0x40000000)
#define GPIO_BSRR_BR_15_MORT                      ((uint32_t)0x80000000)

/******************************************************************************/
/*                                                                            */
/*                                    HASH_MORT                                    */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for HASH_CR register  ********************/


