w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
#if defined(STM32F469_479xx)
/******************************************************************************/
/*                                                                            */
/*                                    DSI_MORT                                     */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for DSI_VR register  *****************/


/*******************  Bit definition for DSI_CR register  *****************/


/*******************  Bit definition for DSI_CCR register  ****************/


/*******************  Bit definition for DSI_LVCIDR register  *************/


/*******************  Bit definition for DSI_LCOLCR register  *************/



/*******************  Bit definition for DSI_LPCR register  ***************/


/*******************  Bit definition for DSI_LPMCR register  **************/


/*******************  Bit definition for DSI_PCR register  ****************/


/*******************  Bit definition for DSI_GVCIDR register  *************/


/*******************  Bit definition for DSI_MCR register  ****************/


/*******************  Bit definition for DSI_VMCR register  ***************/


/*******************  Bit definition for DSI_VPCR register  ***************/


/*******************  Bit definition for DSI_VCCR register  ***************/


/*******************  Bit definition for DSI_VNPCR register  **************/


/*******************  Bit definition for DSI_VHSACR register  *************/


/*******************  Bit definition for DSI_VHBPCR register  *************/


/*******************  Bit definition for DSI_VLCR register  ***************/

/*******************  Bit definition for DSI_VVSACR register  *************/


/*******************  Bit definition for DSI_VVBPCR register  *************/


/*******************  Bit definition for DSI_VVFPCR register  *************/


/*******************  Bit definition for DSI_VVACR register  **************/


/*******************  Bit definition for DSI_LCCR register  ***************/


/*******************  Bit definition for DSI_CMCR register  ***************/


/*******************  Bit definition for DSI_GHCR register  ***************/


/*******************  Bit definition for DSI_GPDR register  ***************/


/*******************  Bit definition for DSI_GPSR register  ***************/

/*******************  Bit definition for DSI_TCCR0 register  **************/


/*******************  Bit definition for DSI_TCCR1 register  **************/


/*******************  Bit definition for DSI_TCCR2 register  **************/


/*******************  Bit definition for DSI_TCCR3 register  **************/


/*******************  Bit definition for DSI_TCCR4 register  **************/


/*******************  Bit definition for DSI_TCCR5 register  **************/


/*******************  Bit definition for DSI_TDCR register  ***************/


/*******************  Bit definition for DSI_CLCR register  ***************/


/*******************  Bit definition for DSI_CLTCR register  **************/


/*******************  Bit definition for DSI_DLTCR register  **************/


/*******************  Bit definition for DSI_PCTLR register  **************/


/*******************  Bit definition for DSI_PCONFR register  *************/


/*******************  Bit definition for DSI_PUCR register  ***************/


/*******************  Bit definition for DSI_PTTCR register  **************/


/*******************  Bit definition for DSI_PSR register  ****************/


/*******************  Bit definition for DSI_ISR0 register  ***************/

/*******************  Bit definition for DSI_ISR1 register  ***************/


/*******************  Bit definition for DSI_IER0 register  ***************/


/*******************  Bit definition for DSI_IER1 register  ***************/


/*******************  Bit definition for DSI_FIR0 register  ***************/


/*******************  Bit definition for DSI_FIR1 register  ***************/


/*******************  Bit definition for DSI_VSCR register  ***************/


/*******************  Bit definition for DSI_LCVCIDR register  ************/


/*******************  Bit definition for DSI_LCCCR register  **************/


/*******************  Bit definition for DSI_LPMCCR register  *************/

/*******************  Bit definition for DSI_VMCCR register  **************/


/*******************  Bit definition for DSI_VPCCR register  **************/


/*******************  Bit definition for DSI_VCCCR register  **************/


/*******************  Bit definition for DSI_VNPCCR register  *************/


/*******************  Bit definition for DSI_VHSACCR register  ************/


/*******************  Bit definition for DSI_VHBPCCR register  ************/


/*******************  Bit definition for DSI_VLCCR register  **************/


/*******************  Bit definition for DSI_VVSACCR register  ***************/


/*******************  Bit definition for DSI_VVBPCCR register  ************/


/*******************  Bit definition for DSI_VVFPCCR register  ************/


/*******************  Bit definition for DSI_VVACCR register  *************/


/*******************  Bit definition for DSI_TDCCR register  **************/


/*******************  Bit definition for DSI_WCFGR register  ***************/

/*******************  Bit definition for DSI_WCR register  *****************/


/*******************  Bit definition for DSI_WIER register  ****************/


/*******************  Bit definition for DSI_WISR register  ****************/

/*******************  Bit definition for DSI_WIFCR register  ***************/

/*******************  Bit definition for DSI_WPCR0 register  ***************/

/*******************  Bit definition for DSI_WPCR1 register  ***************/


/*******************  Bit definition for DSI_WPCR2 register  ***************/


/*******************  Bit definition for DSI_WPCR3 register  ***************/


