w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
/*******************  Bit definition for DSI_WPCR4 register  ***************/


/*******************  Bit definition for DSI_WRPCR register  ***************/

#endif /* STM32F469_479xx */

/******************************************************************************/
/*                                                                            */
/*                             Power Control                                  */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for PWR_CR register  ********************/

/*!< PVD level configuration */

/* Legacy define */

/*******************  Bit definition for PWR_CSR register  ********************/

/* Legacy define */


#if defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx_MORT) || defined(STM32F469_479xx)
/******************************************************************************/
/*                                                                            */
/*                                    QUADSPI_MORT                                 */
/*                                                                            */
/******************************************************************************/
/*****************  Bit definition for QUADSPI_CR register  *******************/

/*****************  Bit definition for QUADSPI_DCR register  ******************/

/******************  Bit definition for QUADSPI_SR register  *******************/

/******************  Bit definition for QUADSPI_FCR register  ******************/

/******************  Bit definition for QUADSPI_DLR register  ******************/

/******************  Bit definition for QUADSPI_CCR register  ******************/

/******************  Bit definition for QUADSPI_AR register  *******************/

/******************  Bit definition for QUADSPI_ABR register  ******************/

/******************  Bit definition for QUADSPI_DR register  *******************/

/******************  Bit definition for QUADSPI_PSMKR register  ****************/

/******************  Bit definition for QUADSPI_PSMAR register  ****************/

/******************  Bit definition for QUADSPI_PIR register  *****************/

/******************  Bit definition for QUADSPI_LPTR register  *****************/
         
#endif /* STM32F412xG || STM32F413_423xx || STM32F446xx_MORT || STM32F469_479xx */

/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for RCC_CR register  ********************/
#define  RCC_CR_HSION_MORT                        ((uint32_t)0x00000001)
#define  RCC_CR_HSIRDY_MORT                       ((uint32_t)0x00000002)

#define  RCC_CR_HSITRIM_MORT                      ((uint32_t)0x000000F8)
#define  RCC_CR_HSITRIM_0_MORT                    ((uint32_t)0x00000008)/*!<Bit 0 */
#define  RCC_CR_HSITRIM_1_MORT                    ((uint32_t)0x00000010)/*!<Bit 1 */
#define  RCC_CR_HSITRIM_2_MORT                    ((uint32_t)0x00000020)/*!<Bit 2 */
#define  RCC_CR_HSITRIM_3_MORT                    ((uint32_t)0x00000040)/*!<Bit 3 */
#define  RCC_CR_HSITRIM_4_MORT                    ((uint32_t)0x00000080)/*!<Bit 4 */

#define  RCC_CR_HSICAL_MORT                       ((uint32_t)0x0000FF00)
#define  RCC_CR_HSICAL_0_MORT                     ((uint32_t)0x00000100)/*!<Bit 0 */
#define  RCC_CR_HSICAL_1_MORT                     ((uint32_t)0x00000200)/*!<Bit 1 */
#define  RCC_CR_HSICAL_2_MORT                     ((uint32_t)0x00000400)/*!<Bit 2 */
#define  RCC_CR_HSICAL_3_MORT                     ((uint32_t)0x00000800)/*!<Bit 3 */
#define  RCC_CR_HSICAL_4_MORT                     ((uint32_t)0x00001000)/*!<Bit 4 */
#define  RCC_CR_HSICAL_5_MORT                     ((uint32_t)0x00002000)/*!<Bit 5 */
#define  RCC_CR_HSICAL_6_MORT                     ((uint32_t)0x00004000)/*!<Bit 6 */
#define  RCC_CR_HSICAL_7_MORT                     ((uint32_t)0x00008000)/*!<Bit 7 */

#define  RCC_CR_HSEON_MORT                        ((uint32_t)0x00010000)
#define  RCC_CR_HSERDY_MORT                       ((uint32_t)0x00020000)
#define  RCC_CR_HSEBYP_MORT                       ((uint32_t)0x00040000)
#define  RCC_CR_CSSON_MORT                        ((uint32_t)0x00080000)
#define  RCC_CR_PLLON_MORT                        ((uint32_t)0x01000000)
#define  RCC_CR_PLLRDY_MORT                       ((uint32_t)0x02000000)
#define  RCC_CR_PLLI2SON_MORT                     ((uint32_t)0x04000000)
#define  RCC_CR_PLLI2SRDY_MORT                    ((uint32_t)0x08000000)
#define  RCC_CR_PLLSAION_MORT                     ((uint32_t)0x10000000)
#define  RCC_CR_PLLSAIRDY_MORT                    ((uint32_t)0x20000000)

/********************  Bit definition for RCC_PLLCFGR register  ***************/
#define  RCC_PLLCFGR_PLLM_MORT                    ((uint32_t)0x0000003F)
#define  RCC_PLLCFGR_PLLM_0_MORT                  ((uint32_t)0x00000001)
#define  RCC_PLLCFGR_PLLM_1_MORT                  ((uint32_t)0x00000002)
#define  RCC_PLLCFGR_PLLM_2_MORT                  ((uint32_t)0x00000004)
#define  RCC_PLLCFGR_PLLM_3_MORT                  ((uint32_t)0x00000008)
#define  RCC_PLLCFGR_PLLM_4_MORT                  ((uint32_t)0x00000010)
#define  RCC_PLLCFGR_PLLM_5_MORT                  ((uint32_t)0x00000020)

#define  RCC_PLLCFGR_PLLN_MORT                     ((uint32_t)0x00007FC0)
#define  RCC_PLLCFGR_PLLN_0_MORT                   ((uint32_t)0x00000040)
#define  RCC_PLLCFGR_PLLN_1_MORT                   ((uint32_t)0x00000080)
#define  RCC_PLLCFGR_PLLN_2_MORT                   ((uint32_t)0x00000100)
#define  RCC_PLLCFGR_PLLN_3_MORT                   ((uint32_t)0x00000200)
#define  RCC_PLLCFGR_PLLN_4_MORT                   ((uint32_t)0x00000400)
#define  RCC_PLLCFGR_PLLN_5_MORT                   ((uint32_t)0x00000800)
#define  RCC_PLLCFGR_PLLN_6_MORT                   ((uint32_t)0x00001000)
#define  RCC_PLLCFGR_PLLN_7_MORT                   ((uint32_t)0x00002000)
#define  RCC_PLLCFGR_PLLN_8_MORT                   ((uint32_t)0x00004000)

#define  RCC_PLLCFGR_PLLP_MORT                    ((uint32_t)0x00030000)
#define  RCC_PLLCFGR_PLLP_0_MORT                  ((uint32_t)0x00010000)
#define  RCC_PLLCFGR_PLLP_1_MORT                  ((uint32_t)0x00020000)

#define  RCC_PLLCFGR_PLLSRC_MORT                  ((uint32_t)0x00400000)
#define  RCC_PLLCFGR_PLLSRC_HSE_MORT              ((uint32_t)0x00400000)
#define  RCC_PLLCFGR_PLLSRC_HSI_MORT              ((uint32_t)0x00000000)

#define  RCC_PLLCFGR_PLLQ_MORT                    ((uint32_t)0x0F000000)
#define  RCC_PLLCFGR_PLLQ_0_MORT                  ((uint32_t)0x01000000)
#define  RCC_PLLCFGR_PLLQ_1_MORT                  ((uint32_t)0x02000000)
#define  RCC_PLLCFGR_PLLQ_2_MORT                  ((uint32_t)0x04000000)
#define  RCC_PLLCFGR_PLLQ_3_MORT                  ((uint32_t)0x08000000)

#if defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx_MORT) || defined(STM32F469_479xx)
#define  RCC_PLLCFGR_PLLR_MORT                    ((uint32_t)0x70000000)
#define  RCC_PLLCFGR_PLLR_0_MORT                  ((uint32_t)0x10000000)
#define  RCC_PLLCFGR_PLLR_1_MORT                  ((uint32_t)0x20000000)
#define  RCC_PLLCFGR_PLLR_2_MORT                  ((uint32_t)0x40000000)
#endif /* STM32F412xG || STM32F413_423xx || STM32F446xx_MORT || STM32F469_479xx */

/********************  Bit definition for RCC_CFGR register  ******************/
/*!< SW configuration */
#define  RCC_CFGR_SW_MORT                         ((uint32_t)0x00000003)        /*!< SW[1:0] bits (System clock Switch) */
#define  RCC_CFGR_SW_0_MORT                       ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  RCC_CFGR_SW_1_MORT                       ((uint32_t)0x00000002)        /*!< Bit 1 */

