w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
#define  RCC_CFGR_MCO2_MORT                       ((uint32_t)0xC0000000)
#define  RCC_CFGR_MCO2_0_MORT                     ((uint32_t)0x40000000)
#define  RCC_CFGR_MCO2_1_MORT                     ((uint32_t)0x80000000)

/********************  Bit definition for RCC_CIR register  *******************/
#define  RCC_CIR_LSIRDYF_MORT                     ((uint32_t)0x00000001)
#define  RCC_CIR_LSERDYF_MORT                     ((uint32_t)0x00000002)
#define  RCC_CIR_HSIRDYF_MORT                     ((uint32_t)0x00000004)
#define  RCC_CIR_HSERDYF_MORT                     ((uint32_t)0x00000008)
#define  RCC_CIR_PLLRDYF_MORT                     ((uint32_t)0x00000010)
#define  RCC_CIR_PLLI2SRDYF_MORT                  ((uint32_t)0x00000020)
#define  RCC_CIR_PLLSAIRDYF_MORT                  ((uint32_t)0x00000040)
#define  RCC_CIR_CSSF_MORT                        ((uint32_t)0x00000080)
#define  RCC_CIR_LSIRDYIE_MORT                    ((uint32_t)0x00000100)
#define  RCC_CIR_LSERDYIE_MORT                    ((uint32_t)0x00000200)
#define  RCC_CIR_HSIRDYIE_MORT                    ((uint32_t)0x00000400)
#define  RCC_CIR_HSERDYIE_MORT                    ((uint32_t)0x00000800)
#define  RCC_CIR_PLLRDYIE_MORT                    ((uint32_t)0x00001000)
#define  RCC_CIR_PLLI2SRDYIE_MORT                 ((uint32_t)0x00002000)
#define  RCC_CIR_PLLSAIRDYIE_MORT                 ((uint32_t)0x00004000)
#define  RCC_CIR_LSIRDYC_MORT                     ((uint32_t)0x00010000)
#define  RCC_CIR_LSERDYC_MORT                     ((uint32_t)0x00020000)
#define  RCC_CIR_HSIRDYC_MORT                     ((uint32_t)0x00040000)
#define  RCC_CIR_HSERDYC_MORT                     ((uint32_t)0x00080000)
#define  RCC_CIR_PLLRDYC_MORT                     ((uint32_t)0x00100000)
#define  RCC_CIR_PLLI2SRDYC_MORT                  ((uint32_t)0x00200000)
#define  RCC_CIR_PLLSAIRDYC_MORT                  ((uint32_t)0x00400000)
#define  RCC_CIR_CSSC_MORT                        ((uint32_t)0x00800000)

/********************  Bit definition for RCC_AHB1RSTR register  **************/
#define  RCC_AHB1RSTR_GPIOARST_MORT               ((uint32_t)0x00000001)
#define  RCC_AHB1RSTR_GPIOBRST_MORT               ((uint32_t)0x00000002)
#define  RCC_AHB1RSTR_GPIOCRST_MORT               ((uint32_t)0x00000004)
#define  RCC_AHB1RSTR_GPIODRST_MORT               ((uint32_t)0x00000008)
#define  RCC_AHB1RSTR_GPIOERST_MORT               ((uint32_t)0x00000010)
#define  RCC_AHB1RSTR_GPIOFRST_MORT               ((uint32_t)0x00000020)
#define  RCC_AHB1RSTR_GPIOGRST_MORT               ((uint32_t)0x00000040)
#define  RCC_AHB1RSTR_GPIOHRST_MORT               ((uint32_t)0x00000080)
#define  RCC_AHB1RSTR_GPIOIRST_MORT               ((uint32_t)0x00000100)
#define  RCC_AHB1RSTR_GPIOJRST_MORT               ((uint32_t)0x00000200)
#define  RCC_AHB1RSTR_GPIOKRST_MORT               ((uint32_t)0x00000400)
#define  RCC_AHB1RSTR_CRCRST_MORT                 ((uint32_t)0x00001000)
#define  RCC_AHB1RSTR_DMA1RST_MORT                ((uint32_t)0x00200000)
#define  RCC_AHB1RSTR_DMA2RST_MORT                ((uint32_t)0x00400000)
#define  RCC_AHB1RSTR_DMA2DRST_MORT               ((uint32_t)0x00800000)
#define  RCC_AHB1RSTR_ETHMACRST_MORT              ((uint32_t)0x02000000)
#define  RCC_AHB1RSTR_OTGHRST_MORT                ((uint32_t)0x10000000)

/********************  Bit definition for RCC_AHB2RSTR register  **************/
#define  RCC_AHB2RSTR_DCMIRST_MORT                ((uint32_t)0x00000001)
#define  RCC_AHB2RSTR_CRYPRST_MORT                ((uint32_t)0x00000010)
#define  RCC_AHB2RSTR_HASHRST_MORT                ((uint32_t)0x00000020)
 /* maintained for legacy purpose */
#define  RCC_AHB2RSTR_HSAHRST_MORT                RCC_AHB2RSTR_HASHRST_MORT
#define  RCC_AHB2RSTR_RNGRST_MORT                 ((uint32_t)0x00000040)
#define  RCC_AHB2RSTR_OTGFSRST_MORT               ((uint32_t)0x00000080)

/********************  Bit definition for RCC_AHB3RSTR register  **************/
#if defined(STM32F40_41xxx) || defined(STM32F412xG) || defined(STM32F413_423xx)

#endif /* STM32F40_41xxx || STM32F412xG || STM32F413_423xx */

#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F446xx_MORT) || defined(STM32F469_479xx)
#define  RCC_AHB3RSTR_FMCRST_MORT                ((uint32_t)0x00000001)
#endif /* STM32F427_437xx ||  STM32F429_439xx || STM32F446xx_MORT || STM32F469_479xx */
#if defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx_MORT) || defined(STM32F469_479xx)
#define  RCC_AHB3RSTR_QSPIRST_MORT               ((uint32_t)0x00000002)
#endif /* STM32F412xG || STM32F413_423xx || STM32F446xx_MORT || STM32F469_479xx */

/********************  Bit definition for RCC_APB1RSTR register  **************/
#define  RCC_APB1RSTR_TIM2RST_MORT                ((uint32_t)0x00000001)
#define  RCC_APB1RSTR_TIM3RST_MORT                ((uint32_t)0x00000002)
#define  RCC_APB1RSTR_TIM4RST_MORT                ((uint32_t)0x00000004)
#define  RCC_APB1RSTR_TIM5RST_MORT                ((uint32_t)0x00000008)
#define  RCC_APB1RSTR_TIM6RST_MORT                ((uint32_t)0x00000010)
#define  RCC_APB1RSTR_TIM7RST_MORT                ((uint32_t)0x00000020)
#define  RCC_APB1RSTR_TIM12RST_MORT               ((uint32_t)0x00000040)
#define  RCC_APB1RSTR_TIM13RST_MORT               ((uint32_t)0x00000080)
#define  RCC_APB1RSTR_TIM14RST_MORT               ((uint32_t)0x00000100)
#if defined(STM32F410xx) || defined(STM32F413_423xx)
#define  RCC_APB1RSTR_LPTIM1RST_MORT              ((uint32_t)0x00000200)
#endif /* STM32F410xx || STM32F413_423xx */
#define  RCC_APB1RSTR_WWDGRST_MORT                ((uint32_t)0x00000800)
#define  RCC_APB1RSTR_SPI2RST_MORT                ((uint32_t)0x00004000)
#define  RCC_APB1RSTR_SPI3RST_MORT                ((uint32_t)0x00008000)
#if defined(STM32F446xx_MORT)
#define  RCC_APB1RSTR_SPDIFRXRST_MORT             ((uint32_t)0x00010000)
#endif /* STM32F446xx_MORT */
#define  RCC_APB1RSTR_USART2RST_MORT              ((uint32_t)0x00020000)
#define  RCC_APB1RSTR_USART3RST_MORT              ((uint32_t)0x00040000)
#define  RCC_APB1RSTR_UART4RST_MORT               ((uint32_t)0x00080000)
#define  RCC_APB1RSTR_UART5RST_MORT               ((uint32_t)0x00100000)
#define  RCC_APB1RSTR_I2C1RST_MORT                ((uint32_t)0x00200000)
#define  RCC_APB1RSTR_I2C2RST_MORT                ((uint32_t)0x00400000)
#define  RCC_APB1RSTR_I2C3RST_MORT                ((uint32_t)0x00800000)
#if defined(STM32F410xx) || defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx_MORT)
#define  RCC_APB1RSTR_FMPI2C1RST_MORT             ((uint32_t)0x01000000)
#endif /* STM32F410xx || STM32F412xG || STM32F413_423xx || STM32F446xx_MORT */
#define  RCC_APB1RSTR_CAN1RST_MORT                ((uint32_t)0x02000000)
#define  RCC_APB1RSTR_CAN2RST_MORT                ((uint32_t)0x04000000)
#if defined(STM32F446xx_MORT)
#define  RCC_APB1RSTR_CECRST_MORT                 ((uint32_t)0x08000000)
#endif /* STM32F446xx_MORT */
#define  RCC_APB1RSTR_PWRRST_MORT                 ((uint32_t)0x10000000)
#define  RCC_APB1RSTR_DACRST_MORT                 ((uint32_t)0x20000000)
#define  RCC_APB1RSTR_UART7RST_MORT               ((uint32_t)0x40000000)
#define  RCC_APB1RSTR_UART8RST_MORT               ((uint32_t)0x80000000)

/********************  Bit definition for RCC_APB2RSTR register  **************/
#define  RCC_APB2RSTR_TIM1RST_MORT                ((uint32_t)0x00000001)
#define  RCC_APB2RSTR_TIM8RST_MORT                ((uint32_t)0x00000002)
#define  RCC_APB2RSTR_USART1RST_MORT              ((uint32_t)0x00000010)
#define  RCC_APB2RSTR_USART6RST_MORT              ((uint32_t)0x00000020)
#define  RCC_APB2RSTR_UART9RST_MORT               ((uint32_t)0x00000040)
#define  RCC_APB2RSTR_UART10RST_MORT              ((uint32_t)0x00000080)
#define  RCC_APB2RSTR_ADCRST_MORT                 ((uint32_t)0x00000100)
#define  RCC_APB2RSTR_SDIORST_MORT                ((uint32_t)0x00000800)
#define  RCC_APB2RSTR_SPI1RST_MORT                ((uint32_t)0x00001000)
#define  RCC_APB2RSTR_SPI4RST_MORT                ((uint32_t)0x00002000)
#define  RCC_APB2RSTR_SYSCFGRST_MORT              ((uint32_t)0x00004000)
#define  RCC_APB2RSTR_TIM9RST_MORT                ((uint32_t)0x00010000)
#define  RCC_APB2RSTR_TIM10RST_MORT               ((uint32_t)0x00020000)
#define  RCC_APB2RSTR_TIM11RST_MORT               ((uint32_t)0x00040000)
#define  RCC_APB2RSTR_SPI5RST_MORT                ((uint32_t)0x00100000)
#define  RCC_APB2RSTR_SPI6RST_MORT                ((uint32_t)0x00200000)
#define  RCC_APB2RSTR_SAI1RST_MORT                ((uint32_t)0x00400000)
#if defined(STM32F446xx_MORT)
#define  RCC_APB2RSTR_SAI2RST_MORT                ((uint32_t)0x00800000)
#endif /* STM32F446xx_MORT */
#define  RCC_APB2RSTR_LTDCRST_MORT                ((uint32_t)0x04000000)
#if defined(STM32F469_479xx)
#define  RCC_APB2RSTR_DSIRST_MORT                 ((uint32_t)0x08000000)
#endif /* STM32F469_479xx */
#if defined(STM32F412xG) || defined(STM32F413_423xx)
#define  RCC_APB2RSTR_DFSDM1RST_MORT              ((uint32_t)0x01000000)
#endif /* STM32F412xG || STM32F413_423xx */

#if defined(STM32F413_423xx)
#define  RCC_APB2RSTR_DFSDM2RST_MORT              ((uint32_t)0x02000000)
#endif /* STM32F413_423xx */
/* Old definitions, maintained for legacy purpose */
#define  RCC_APB2RSTR_SPI1_MORT                   RCC_APB2RSTR_SPI1RST_MORT
#define  RCC_APB2RSTR_DFSDMRST               RCC_APB2RSTR_DFSDM1RST_MORT

/********************  Bit definition for RCC_AHB1ENR register  ***************/
#define  RCC_AHB1ENR_GPIOAEN_MORT                 ((uint32_t)0x00000001)
#define  RCC_AHB1ENR_GPIOBEN_MORT                 ((uint32_t)0x00000002)
#define  RCC_AHB1ENR_GPIOCEN_MORT                 ((uint32_t)0x00000004)
#define  RCC_AHB1ENR_GPIODEN_MORT                 ((uint32_t)0x00000008)
#define  RCC_AHB1ENR_GPIOEEN_MORT                 ((uint32_t)0x00000010)
#define  RCC_AHB1ENR_GPIOFEN_MORT                 ((uint32_t)0x00000020)
#define  RCC_AHB1ENR_GPIOGEN_MORT                 ((uint32_t)0x00000040)
#define  RCC_AHB1ENR_GPIOHEN_MORT                 ((uint32_t)0x00000080)
#define  RCC_AHB1ENR_GPIOIEN_MORT                 ((uint32_t)0x00000100)
#define  RCC_AHB1ENR_GPIOJEN_MORT                 ((uint32_t)0x00000200)
#define  RCC_AHB1ENR_GPIOKEN_MORT                 ((uint32_t)0x00000400)
#define  RCC_AHB1ENR_CRCEN_MORT                   ((uint32_t)0x00001000)
#define  RCC_AHB1ENR_BKPSRAMEN_MORT               ((uint32_t)0x00040000)
#define  RCC_AHB1ENR_CCMDATARAMEN_MORT            ((uint32_t)0x00100000)
#define  RCC_AHB1ENR_DMA1EN_MORT                  ((uint32_t)0x00200000)
#define  RCC_AHB1ENR_DMA2EN_MORT                  ((uint32_t)0x00400000)
#define  RCC_AHB1ENR_DMA2DEN_MORT                 ((uint32_t)0x00800000)
#define  RCC_AHB1ENR_ETHMACEN_MORT                ((uint32_t)0x02000000)
#define  RCC_AHB1ENR_ETHMACTXEN_MORT              ((uint32_t)0x04000000)
#define  RCC_AHB1ENR_ETHMACRXEN_MORT              ((uint32_t)0x08000000)
#define  RCC_AHB1ENR_ETHMACPTPEN_MORT             ((uint32_t)0x10000000)
#define  RCC_AHB1ENR_OTGHSEN_MORT                 ((uint32_t)0x20000000)
#define  RCC_AHB1ENR_OTGHSULPIEN_MORT             ((uint32_t)0x40000000)

/********************  Bit definition for RCC_AHB2ENR register  ***************/
#define  RCC_AHB2ENR_DCMIEN_MORT                  ((uint32_t)0x00000001)
#define  RCC_AHB2ENR_CRYPEN_MORT                  ((uint32_t)0x00000010)
#define  RCC_AHB2ENR_HASHEN_MORT                  ((uint32_t)0x00000020)
#define  RCC_AHB2ENR_RNGEN_MORT                   ((uint32_t)0x00000040)
#define  RCC_AHB2ENR_OTGFSEN_MORT                 ((uint32_t)0x00000080)

