w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
/********************  Bit definition for RCC_AHB3ENR register  ***************/

#if defined(STM32F40_41xxx) || defined(STM32F412xG) || defined(STM32F413_423xx)

#endif /* STM32F40_41xxx || STM32F412xG || STM32F413_423xx */

#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F446xx_MORT) || defined(STM32F469_479xx)
#define  RCC_AHB3ENR_FMCEN_MORT                  ((uint32_t)0x00000001)
#endif /* STM32F427_437xx ||  STM32F429_439xx || STM32F446xx_MORT || STM32F469_479xx */

#if defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx_MORT) || defined(STM32F469_479xx)
#define  RCC_AHB3ENR_QSPIEN_MORT                 ((uint32_t)0x00000002)
#endif /* STM32F412xG || STM32F413_423xx || STM32F446xx_MORT || STM32F469_479xx */

/********************  Bit definition for RCC_APB1ENR register  ***************/
#define  RCC_APB1ENR_TIM2EN_MORT                  ((uint32_t)0x00000001)
#define  RCC_APB1ENR_TIM3EN_MORT                  ((uint32_t)0x00000002)
#define  RCC_APB1ENR_TIM4EN_MORT                  ((uint32_t)0x00000004)
#define  RCC_APB1ENR_TIM5EN_MORT                  ((uint32_t)0x00000008)
#define  RCC_APB1ENR_TIM6EN_MORT                  ((uint32_t)0x00000010)
#define  RCC_APB1ENR_TIM7EN_MORT                  ((uint32_t)0x00000020)
#define  RCC_APB1ENR_TIM12EN_MORT                 ((uint32_t)0x00000040)
#define  RCC_APB1ENR_TIM13EN_MORT                 ((uint32_t)0x00000080)
#define  RCC_APB1ENR_TIM14EN_MORT                 ((uint32_t)0x00000100)
#if defined(STM32F410xx) || defined(STM32F413_423xx)

#endif /* STM32F410xx || STM32F413_423xx */
#define  RCC_APB1ENR_WWDGEN_MORT                  ((uint32_t)0x00000800)
#define  RCC_APB1ENR_SPI2EN_MORT                  ((uint32_t)0x00004000)
#define  RCC_APB1ENR_SPI3EN_MORT                  ((uint32_t)0x00008000)
#if defined(STM32F446xx_MORT)
#define  RCC_APB1ENR_SPDIFRXEN_MORT               ((uint32_t)0x00010000)
#endif /* STM32F446xx_MORT */
#define  RCC_APB1ENR_USART2EN_MORT                ((uint32_t)0x00020000)
#define  RCC_APB1ENR_USART3EN_MORT                ((uint32_t)0x00040000)
#define  RCC_APB1ENR_UART4EN_MORT                 ((uint32_t)0x00080000)
#define  RCC_APB1ENR_UART5EN_MORT                 ((uint32_t)0x00100000)
#define  RCC_APB1ENR_I2C1EN_MORT                  ((uint32_t)0x00200000)
#define  RCC_APB1ENR_I2C2EN_MORT                  ((uint32_t)0x00400000)
#define  RCC_APB1ENR_I2C3EN_MORT                  ((uint32_t)0x00800000)
#if defined(STM32F410xx) || defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx_MORT)
#define  RCC_APB1ENR_FMPI2C1EN_MORT               ((uint32_t)0x01000000)
#endif /* STM32F410xx || STM32F412xG || STM32F413_423xx || STM32F446xx_MORT */
#define  RCC_APB1ENR_CAN1EN_MORT                  ((uint32_t)0x02000000)
#define  RCC_APB1ENR_CAN2EN_MORT                  ((uint32_t)0x04000000)
#if defined(STM32F446xx_MORT)
#define  RCC_APB1ENR_CECEN_MORT                   ((uint32_t)0x08000000)
#endif /* STM32F446xx_MORT */
#define  RCC_APB1ENR_PWREN_MORT                   ((uint32_t)0x10000000)
#define  RCC_APB1ENR_DACEN_MORT                   ((uint32_t)0x20000000)
#define  RCC_APB1ENR_UART7EN_MORT                 ((uint32_t)0x40000000)
#define  RCC_APB1ENR_UART8EN_MORT                 ((uint32_t)0x80000000)

/********************  Bit definition for RCC_APB2ENR register  ***************/
#define  RCC_APB2ENR_TIM1EN_MORT                  ((uint32_t)0x00000001)
#define  RCC_APB2ENR_TIM8EN_MORT                  ((uint32_t)0x00000002)
#define  RCC_APB2ENR_USART1EN_MORT                ((uint32_t)0x00000010)
#define  RCC_APB2ENR_USART6EN_MORT                ((uint32_t)0x00000020)
#define  RCC_APB2ENR_UART9EN_MORT                 ((uint32_t)0x00000040)
#define  RCC_APB2ENR_UART10EN_MORT                ((uint32_t)0x00000080)
#define  RCC_APB2ENR_ADC1EN_MORT                  ((uint32_t)0x00000100)
#define  RCC_APB2ENR_ADC2EN_MORT                  ((uint32_t)0x00000200)
#define  RCC_APB2ENR_ADC3EN_MORT                  ((uint32_t)0x00000400)
#define  RCC_APB2ENR_SDIOEN_MORT                  ((uint32_t)0x00000800)
#define  RCC_APB2ENR_SPI1EN_MORT                  ((uint32_t)0x00001000)
#define  RCC_APB2ENR_SPI4EN_MORT                  ((uint32_t)0x00002000)
#define  RCC_APB2ENR_SYSCFGEN_MORT                ((uint32_t)0x00004000)
#define  RCC_APB2ENR_EXTIEN_MORT                  ((uint32_t)0x00008000)
#define  RCC_APB2ENR_TIM9EN_MORT                  ((uint32_t)0x00010000)
#define  RCC_APB2ENR_TIM10EN_MORT                 ((uint32_t)0x00020000)
#define  RCC_APB2ENR_TIM11EN_MORT                 ((uint32_t)0x00040000)
#define  RCC_APB2ENR_SPI5EN_MORT                  ((uint32_t)0x00100000)
#define  RCC_APB2ENR_SPI6EN_MORT                  ((uint32_t)0x00200000)
#define  RCC_APB2ENR_SAI1EN_MORT                  ((uint32_t)0x00400000)
#if defined(STM32F446xx_MORT)
#define  RCC_APB2ENR_SAI2EN_MORT                  ((uint32_t)0x00800000)
#endif /* STM32F446xx_MORT */
#define  RCC_APB2ENR_LTDCEN_MORT                  ((uint32_t)0x04000000)
#if defined(STM32F469_479xx)
#define  RCC_APB2ENR_DSIEN_MORT                   ((uint32_t)0x08000000)
#endif /* STM32F469_479xx */
#if defined(STM32F412xG) || defined(STM32F413_423xx)
#define  RCC_APB2ENR_DFSDM1EN_MORT                ((uint32_t)0x01000000)
#endif /* STM32F412xG || STM32F413_423xx */
#if defined(STM32F413_423xx)
#define  RCC_APB2ENR_DFSDM2EN_MORT                ((uint32_t)0x02000000)
#endif /* STM32F413_423xx */
/********************  Bit definition for RCC_AHB1LPENR register  *************/
#define  RCC_AHB1LPENR_GPIOALPEN_MORT             ((uint32_t)0x00000001)
#define  RCC_AHB1LPENR_GPIOBLPEN_MORT             ((uint32_t)0x00000002)
#define  RCC_AHB1LPENR_GPIOCLPEN_MORT             ((uint32_t)0x00000004)
#define  RCC_AHB1LPENR_GPIODLPEN_MORT             ((uint32_t)0x00000008)
#define  RCC_AHB1LPENR_GPIOELPEN_MORT             ((uint32_t)0x00000010)
#define  RCC_AHB1LPENR_GPIOFLPEN_MORT             ((uint32_t)0x00000020)
#define  RCC_AHB1LPENR_GPIOGLPEN_MORT             ((uint32_t)0x00000040)
#define  RCC_AHB1LPENR_GPIOHLPEN_MORT             ((uint32_t)0x00000080)
#define  RCC_AHB1LPENR_GPIOILPEN_MORT             ((uint32_t)0x00000100)
#define  RCC_AHB1LPENR_GPIOJLPEN_MORT             ((uint32_t)0x00000200)
#define  RCC_AHB1LPENR_GPIOKLPEN_MORT             ((uint32_t)0x00000400)
#define  RCC_AHB1LPENR_CRCLPEN_MORT               ((uint32_t)0x00001000)
#define  RCC_AHB1LPENR_FLITFLPEN_MORT             ((uint32_t)0x00008000)
#define  RCC_AHB1LPENR_SRAM1LPEN_MORT             ((uint32_t)0x00010000)
#define  RCC_AHB1LPENR_SRAM2LPEN_MORT             ((uint32_t)0x00020000)
#define  RCC_AHB1LPENR_BKPSRAMLPEN_MORT           ((uint32_t)0x00040000)
#define  RCC_AHB1LPENR_SRAM3LPEN_MORT             ((uint32_t)0x00080000)
#define  RCC_AHB1LPENR_DMA1LPEN_MORT              ((uint32_t)0x00200000)
#define  RCC_AHB1LPENR_DMA2LPEN_MORT              ((uint32_t)0x00400000)
#define  RCC_AHB1LPENR_DMA2DLPEN_MORT             ((uint32_t)0x00800000)
#define  RCC_AHB1LPENR_ETHMACLPEN_MORT            ((uint32_t)0x02000000)
#define  RCC_AHB1LPENR_ETHMACTXLPEN_MORT          ((uint32_t)0x04000000)
#define  RCC_AHB1LPENR_ETHMACRXLPEN_MORT          ((uint32_t)0x08000000)
#define  RCC_AHB1LPENR_ETHMACPTPLPEN_MORT         ((uint32_t)0x10000000)
#define  RCC_AHB1LPENR_OTGHSLPEN_MORT             ((uint32_t)0x20000000)
#define  RCC_AHB1LPENR_OTGHSULPILPEN_MORT         ((uint32_t)0x40000000)

