w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
/********************  Bit definition for RCC_AHB2LPENR register  *************/
#define  RCC_AHB2LPENR_DCMILPEN_MORT              ((uint32_t)0x00000001)
#define  RCC_AHB2LPENR_CRYPLPEN_MORT              ((uint32_t)0x00000010)
#define  RCC_AHB2LPENR_HASHLPEN_MORT              ((uint32_t)0x00000020)
#define  RCC_AHB2LPENR_RNGLPEN_MORT               ((uint32_t)0x00000040)
#define  RCC_AHB2LPENR_OTGFSLPEN_MORT             ((uint32_t)0x00000080)

/********************  Bit definition for RCC_AHB3LPENR register  *************/
#if defined(STM32F40_41xxx) || defined(STM32F412xG) || defined(STM32F413_423xx)
#define  RCC_AHB3LPENR_FSMCLPEN_MORT              ((uint32_t)0x00000001)
#endif /* STM32F40_41xxx || STM32F412xG || STM32F413_423xx */

#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F446xx_MORT) || defined(STM32F469_479xx)
#define  RCC_AHB3LPENR_FMCLPEN_MORT              ((uint32_t)0x00000001)
#endif /* STM32F427_437xx ||  STM32F429_439xx  || STM32F446xx_MORT || STM32F469_479xx */
#if defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx_MORT) || defined(STM32F469_479xx)
#define  RCC_AHB3LPENR_QSPILPEN_MORT             ((uint32_t)0x00000002)
#endif /* STM32F412xG || STM32F413_423xx || STM32F469_479xx || STM32F446xx_MORT */

/********************  Bit definition for RCC_APB1LPENR register  *************/
#define  RCC_APB1LPENR_TIM2LPEN_MORT              ((uint32_t)0x00000001)
#define  RCC_APB1LPENR_TIM3LPEN_MORT              ((uint32_t)0x00000002)
#define  RCC_APB1LPENR_TIM4LPEN_MORT              ((uint32_t)0x00000004)
#define  RCC_APB1LPENR_TIM5LPEN_MORT              ((uint32_t)0x00000008)
#define  RCC_APB1LPENR_TIM6LPEN_MORT              ((uint32_t)0x00000010)
#define  RCC_APB1LPENR_TIM7LPEN_MORT              ((uint32_t)0x00000020)
#define  RCC_APB1LPENR_TIM12LPEN_MORT             ((uint32_t)0x00000040)
#define  RCC_APB1LPENR_TIM13LPEN_MORT             ((uint32_t)0x00000080)
#define  RCC_APB1LPENR_TIM14LPEN_MORT             ((uint32_t)0x00000100)
#if defined(STM32F410xx) || defined(STM32F413_423xx)
#define  RCC_APB1LPENR_LPTIM1LPEN_MORT            ((uint32_t)0x00000200)
#endif /* STM32F410xx || STM32F413_423xx */
#define  RCC_APB1LPENR_WWDGLPEN_MORT              ((uint32_t)0x00000800)
#define  RCC_APB1LPENR_SPI2LPEN_MORT              ((uint32_t)0x00004000)
#define  RCC_APB1LPENR_SPI3LPEN_MORT              ((uint32_t)0x00008000)
#if defined(STM32F446xx_MORT)
#define  RCC_APB1LPENR_SPDIFRXLPEN_MORT           ((uint32_t)0x00010000)
#endif /* STM32F446xx_MORT */
#define  RCC_APB1LPENR_USART2LPEN_MORT            ((uint32_t)0x00020000)
#define  RCC_APB1LPENR_USART3LPEN_MORT            ((uint32_t)0x00040000)
#define  RCC_APB1LPENR_UART4LPEN_MORT             ((uint32_t)0x00080000)
#define  RCC_APB1LPENR_UART5LPEN_MORT             ((uint32_t)0x00100000)
#define  RCC_APB1LPENR_I2C1LPEN_MORT              ((uint32_t)0x00200000)
#define  RCC_APB1LPENR_I2C2LPEN_MORT              ((uint32_t)0x00400000)
#define  RCC_APB1LPENR_I2C3LPEN_MORT              ((uint32_t)0x00800000)
#if defined(STM32F410xx) || defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx_MORT)
#define  RCC_APB1LPENR_FMPI2C1LPEN_MORT           ((uint32_t)0x01000000)
#endif /* STM32F410xx || STM32F412xG || STM32F413_423xx || STM32F446xx_MORT */
#define  RCC_APB1LPENR_CAN1LPEN_MORT              ((uint32_t)0x02000000)
#define  RCC_APB1LPENR_CAN2LPEN_MORT              ((uint32_t)0x04000000)
#if defined(STM32F446xx_MORT)
#define  RCC_APB1LPENR_CECLPEN_MORT               ((uint32_t)0x08000000)
#endif /* STM32F446xx_MORT */
#define  RCC_APB1LPENR_PWRLPEN_MORT               ((uint32_t)0x10000000)
#define  RCC_APB1LPENR_DACLPEN_MORT               ((uint32_t)0x20000000)
#define  RCC_APB1LPENR_UART7LPEN_MORT             ((uint32_t)0x40000000)
#define  RCC_APB1LPENR_UART8LPEN_MORT             ((uint32_t)0x80000000)

/********************  Bit definition for RCC_APB2LPENR register  *************/
#define  RCC_APB2LPENR_TIM1LPEN_MORT              ((uint32_t)0x00000001)
#define  RCC_APB2LPENR_TIM8LPEN_MORT              ((uint32_t)0x00000002)
#define  RCC_APB2LPENR_USART1LPEN_MORT            ((uint32_t)0x00000010)
#define  RCC_APB2LPENR_USART6LPEN_MORT            ((uint32_t)0x00000020)
#define  RCC_APB2LPENR_UART9LPEN_MORT             ((uint32_t)0x00000040)
#define  RCC_APB2LPENR_UART10LPEN_MORT            ((uint32_t)0x00000080)
#define  RCC_APB2LPENR_ADC1LPEN_MORT              ((uint32_t)0x00000100)
#define  RCC_APB2LPENR_ADC2PEN_MORT               ((uint32_t)0x00000200)
#define  RCC_APB2LPENR_ADC3LPEN_MORT              ((uint32_t)0x00000400)
#define  RCC_APB2LPENR_SDIOLPEN_MORT              ((uint32_t)0x00000800)
#define  RCC_APB2LPENR_SPI1LPEN_MORT              ((uint32_t)0x00001000)
#define  RCC_APB2LPENR_SPI4LPEN_MORT              ((uint32_t)0x00002000)
#define  RCC_APB2LPENR_SYSCFGLPEN_MORT            ((uint32_t)0x00004000)
#define  RCC_APB2LPENR_TIM9LPEN_MORT              ((uint32_t)0x00010000)
#define  RCC_APB2LPENR_TIM10LPEN_MORT             ((uint32_t)0x00020000)
#define  RCC_APB2LPENR_TIM11LPEN_MORT             ((uint32_t)0x00040000)
#define  RCC_APB2LPENR_SPI5LPEN_MORT              ((uint32_t)0x00100000)
#define  RCC_APB2LPENR_SPI6LPEN_MORT              ((uint32_t)0x00200000)
#define  RCC_APB2LPENR_SAI1LPEN_MORT              ((uint32_t)0x00400000)
#if defined(STM32F446xx_MORT)
#define  RCC_APB2LPENR_SAI2LPEN_MORT              ((uint32_t)0x00800000)
#endif /* STM32F446xx_MORT */
#define  RCC_APB2LPENR_LTDCLPEN_MORT              ((uint32_t)0x04000000)
#if defined(STM32F469_479xx)

#endif /* STM32F469_479xx */
#if defined(STM32F412xG) || defined(STM32F413_423xx)

#endif /* STM32F412xG || STM32F413_423xx */
#if defined(STM32F413_423xx)

#endif /* STM32F413_423xx */

/********************  Bit definition for RCC_BDCR register  ******************/
#define  RCC_BDCR_LSEON_MORT                      ((uint32_t)0x00000001)
#define  RCC_BDCR_LSERDY_MORT                     ((uint32_t)0x00000002)
#define  RCC_BDCR_LSEBYP_MORT                     ((uint32_t)0x00000004)
#define  RCC_BDCR_LSEMOD_MORT                     ((uint32_t)0x00000008)

#define  RCC_BDCR_RTCSEL_MORT                    ((uint32_t)0x00000300)
#define  RCC_BDCR_RTCSEL_0_MORT                  ((uint32_t)0x00000100)
#define  RCC_BDCR_RTCSEL_1_MORT                  ((uint32_t)0x00000200)

#define  RCC_BDCR_RTCEN_MORT                      ((uint32_t)0x00008000)
#define  RCC_BDCR_BDRST_MORT                      ((uint32_t)0x00010000)

/********************  Bit definition for RCC_CSR register  *******************/
#define  RCC_CSR_LSION_MORT                       ((uint32_t)0x00000001)
#define  RCC_CSR_LSIRDY_MORT                      ((uint32_t)0x00000002)
#define  RCC_CSR_RMVF_MORT                        ((uint32_t)0x01000000)
#define  RCC_CSR_BORRSTF_MORT                     ((uint32_t)0x02000000)
#define  RCC_CSR_PADRSTF_MORT                     ((uint32_t)0x04000000)
#define  RCC_CSR_PORRSTF_MORT                     ((uint32_t)0x08000000)
#define  RCC_CSR_SFTRSTF_MORT                     ((uint32_t)0x10000000)
#define  RCC_CSR_WDGRSTF_MORT                     ((uint32_t)0x20000000)
#define  RCC_CSR_WWDGRSTF_MORT                    ((uint32_t)0x40000000)
#define  RCC_CSR_LPWRRSTF_MORT                    ((uint32_t)0x80000000)

/********************  Bit definition for RCC_SSCGR register  *****************/
#define  RCC_SSCGR_MODPER_MORT                    ((uint32_t)0x00001FFF)
#define  RCC_SSCGR_INCSTEP_MORT                   ((uint32_t)0x0FFFE000)
#define  RCC_SSCGR_SPREADSEL_MORT                 ((uint32_t)0x40000000)
#define  RCC_SSCGR_SSCGEN_MORT                    ((uint32_t)0x80000000)

/********************  Bit definition for RCC_PLLI2SCFGR register  ************/
#define  RCC_PLLI2SCFGR_PLLI2SM_MORT              ((uint32_t)0x0000003F)
#define  RCC_PLLI2SCFGR_PLLI2SM_0_MORT            ((uint32_t)0x00000001)
#define  RCC_PLLI2SCFGR_PLLI2SM_1_MORT            ((uint32_t)0x00000002)
#define  RCC_PLLI2SCFGR_PLLI2SM_2_MORT            ((uint32_t)0x00000004)
#define  RCC_PLLI2SCFGR_PLLI2SM_3_MORT            ((uint32_t)0x00000008)
#define  RCC_PLLI2SCFGR_PLLI2SM_4_MORT            ((uint32_t)0x00000010)
#define  RCC_PLLI2SCFGR_PLLI2SM_5_MORT            ((uint32_t)0x00000020)

#define  RCC_PLLI2SCFGR_PLLI2SN_MORT              ((uint32_t)0x00007FC0)
#define  RCC_PLLI2SCFGR_PLLI2SN_0_MORT            ((uint32_t)0x00000040)
#define  RCC_PLLI2SCFGR_PLLI2SN_1_MORT            ((uint32_t)0x00000080)
#define  RCC_PLLI2SCFGR_PLLI2SN_2_MORT            ((uint32_t)0x00000100)
#define  RCC_PLLI2SCFGR_PLLI2SN_3_MORT            ((uint32_t)0x00000200)
#define  RCC_PLLI2SCFGR_PLLI2SN_4_MORT            ((uint32_t)0x00000400)
#define  RCC_PLLI2SCFGR_PLLI2SN_5_MORT            ((uint32_t)0x00000800)
#define  RCC_PLLI2SCFGR_PLLI2SN_6_MORT            ((uint32_t)0x00001000)
#define  RCC_PLLI2SCFGR_PLLI2SN_7_MORT            ((uint32_t)0x00002000)
#define  RCC_PLLI2SCFGR_PLLI2SN_8_MORT            ((uint32_t)0x00004000)

#if defined(STM32F412xG) || defined(STM32F413_423xx)

#endif /* STM32F412xG || STM32F413_423xx */

#if defined(STM32F446xx_MORT)
#define  RCC_PLLI2SCFGR_PLLI2SP_MORT              ((uint32_t)0x00030000)
#define  RCC_PLLI2SCFGR_PLLI2SP_0_MORT            ((uint32_t)0x00010000)
#define  RCC_PLLI2SCFGR_PLLI2SP_1_MORT            ((uint32_t)0x00020000)
#endif /* STM32F446xx_MORT */

#define  RCC_PLLI2SCFGR_PLLI2SQ_MORT              ((uint32_t)0x0F000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_0_MORT            ((uint32_t)0x01000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_1_MORT            ((uint32_t)0x02000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_2_MORT            ((uint32_t)0x04000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_3_MORT            ((uint32_t)0x08000000)

#define  RCC_PLLI2SCFGR_PLLI2SR_MORT              ((uint32_t)0x70000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_0_MORT            ((uint32_t)0x10000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_1_MORT            ((uint32_t)0x20000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_2_MORT            ((uint32_t)0x40000000)

/********************  Bit definition for RCC_PLLSAICFGR register  ************/
#if defined(STM32F446xx_MORT)
#define  RCC_PLLSAICFGR_PLLSAIM_MORT              ((uint32_t)0x0000003F)
#define  RCC_PLLSAICFGR_PLLSAIM_0_MORT            ((uint32_t)0x00000001)
#define  RCC_PLLSAICFGR_PLLSAIM_1_MORT            ((uint32_t)0x00000002)
#define  RCC_PLLSAICFGR_PLLSAIM_2_MORT            ((uint32_t)0x00000004)
#define  RCC_PLLSAICFGR_PLLSAIM_3_MORT            ((uint32_t)0x00000008)
#define  RCC_PLLSAICFGR_PLLSAIM_4_MORT            ((uint32_t)0x00000010)
#define  RCC_PLLSAICFGR_PLLSAIM_5_MORT            ((uint32_t)0x00000020)
#endif /* STM32F446xx_MORT */

#define  RCC_PLLSAICFGR_PLLSAIN_MORT              ((uint32_t)0x00007FC0)
#define  RCC_PLLSAICFGR_PLLSAIN_0_MORT            ((uint32_t)0x00000040)
#define  RCC_PLLSAICFGR_PLLSAIN_1_MORT            ((uint32_t)0x00000080)
#define  RCC_PLLSAICFGR_PLLSAIN_2_MORT            ((uint32_t)0x00000100)
#define  RCC_PLLSAICFGR_PLLSAIN_3_MORT            ((uint32_t)0x00000200)
#define  RCC_PLLSAICFGR_PLLSAIN_4_MORT            ((uint32_t)0x00000400)
#define  RCC_PLLSAICFGR_PLLSAIN_5_MORT            ((uint32_t)0x00000800)
#define  RCC_PLLSAICFGR_PLLSAIN_6_MORT            ((uint32_t)0x00001000)
#define  RCC_PLLSAICFGR_PLLSAIN_7_MORT            ((uint32_t)0x00002000)
#define  RCC_PLLSAICFGR_PLLSAIN_8_MORT            ((uint32_t)0x00004000)

#if defined(STM32F446xx_MORT) || defined(STM32F469_479xx)  
#define  RCC_PLLSAICFGR_PLLSAIP_MORT              ((uint32_t)0x00030000)
#define  RCC_PLLSAICFGR_PLLSAIP_0_MORT            ((uint32_t)0x00010000)
#define  RCC_PLLSAICFGR_PLLSAIP_1_MORT            ((uint32_t)0x00020000)
#endif /* STM32F446xx_MORT || STM32F469_479xx */

#define  RCC_PLLSAICFGR_PLLSAIQ_MORT              ((uint32_t)0x0F000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_0_MORT            ((uint32_t)0x01000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_1_MORT            ((uint32_t)0x02000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_2_MORT            ((uint32_t)0x04000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_3_MORT            ((uint32_t)0x08000000)

#define  RCC_PLLSAICFGR_PLLSAIR_MORT              ((uint32_t)0x70000000)
#define  RCC_PLLSAICFGR_PLLSAIR_0_MORT            ((uint32_t)0x10000000)
#define  RCC_PLLSAICFGR_PLLSAIR_1_MORT            ((uint32_t)0x20000000)
#define  RCC_PLLSAICFGR_PLLSAIR_2_MORT            ((uint32_t)0x40000000)

/********************  Bit definition for RCC_DCKCFGR register  ***************/
#define  RCC_DCKCFGR_PLLI2SDIVQ_MORT              ((uint32_t)0x0000001F)
#define  RCC_DCKCFGR_PLLSAIDIVQ_MORT              ((uint32_t)0x00001F00)
#define  RCC_DCKCFGR_PLLSAIDIVR_MORT              ((uint32_t)0x00030000)

#if defined(STM32F412xG) || defined(STM32F413_423xx)

#endif /* STM32F412xG || STM32F413_423xx */

#if defined(STM32F413_423xx)

