w3ichen/haptic-hand/mbed/stm32f4xx_mort2.h
#endif /* STM32F413_423xx */

#define  RCC_DCKCFGR_SAI1ASRC_MORT                ((uint32_t)0x00300000)
#define  RCC_DCKCFGR_SAI1ASRC_0_MORT              ((uint32_t)0x00100000)
#define  RCC_DCKCFGR_SAI1ASRC_1_MORT              ((uint32_t)0x00200000)
#if defined(STM32F446xx_MORT)
#define  RCC_DCKCFGR_SAI1SRC_MORT                 ((uint32_t)0x00300000)
#define  RCC_DCKCFGR_SAI1SRC_0_MORT               ((uint32_t)0x00100000)
#define  RCC_DCKCFGR_SAI1SRC_1_MORT               ((uint32_t)0x00200000)
#endif /* STM32F446xx_MORT */

#define  RCC_DCKCFGR_SAI1BSRC_MORT                ((uint32_t)0x00C00000)
#define  RCC_DCKCFGR_SAI1BSRC_0_MORT              ((uint32_t)0x00400000)
#define  RCC_DCKCFGR_SAI1BSRC_1_MORT              ((uint32_t)0x00800000)
#if defined(STM32F446xx_MORT)
#define  RCC_DCKCFGR_SAI2SRC_MORT                 ((uint32_t)0x00C00000)
#define  RCC_DCKCFGR_SAI2SRC_0_MORT               ((uint32_t)0x00400000)
#define  RCC_DCKCFGR_SAI2SRC_1_MORT               ((uint32_t)0x00800000)
#endif /* STM32F446xx_MORT */

#define  RCC_DCKCFGR_TIMPRE_MORT                  ((uint32_t)0x01000000)
#if defined(STM32F469_479xx)

#endif /* STM32F469_479xx */

#if defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx_MORT)
#define  RCC_DCKCFGR_I2S1SRC_MORT                 ((uint32_t)0x06000000)
#define  RCC_DCKCFGR_I2S1SRC_0_MORT               ((uint32_t)0x02000000)
#define  RCC_DCKCFGR_I2S1SRC_1_MORT               ((uint32_t)0x04000000)
#define  RCC_DCKCFGR_I2S2SRC_MORT                 ((uint32_t)0x18000000)
#define  RCC_DCKCFGR_I2S2SRC_0_MORT               ((uint32_t)0x08000000)
#define  RCC_DCKCFGR_I2S2SRC_1_MORT               ((uint32_t)0x10000000)

/********************  Bit definition for RCC_CKGATENR register  ***************/
#define  RCC_CKGATENR_AHB2APB1_CKEN_MORT          ((uint32_t)0x00000001)
#define  RCC_CKGATENR_AHB2APB2_CKEN_MORT          ((uint32_t)0x00000002)
#define  RCC_CKGATENR_CM4DBG_CKEN_MORT            ((uint32_t)0x00000004)
#define  RCC_CKGATENR_SPARE_CKEN_MORT             ((uint32_t)0x00000008)
#define  RCC_CKGATENR_SRAM_CKEN_MORT              ((uint32_t)0x00000010)
#define  RCC_CKGATENR_FLITF_CKEN_MORT             ((uint32_t)0x00000020)
#define  RCC_CKGATENR_RCC_CKEN_MORT               ((uint32_t)0x00000040)
#if defined(STM32F412xG) || defined(STM32F413_423xx)

#endif /* STM32F412xG || STM32F413_423xx */

/********************  Bit definition for RCC_DCKCFGR2 register  ***************/
#define  RCC_DCKCFGR2_FMPI2C1SEL_MORT             ((uint32_t)0x00C00000)
#define  RCC_DCKCFGR2_FMPI2C1SEL_0_MORT           ((uint32_t)0x00400000)
#define  RCC_DCKCFGR2_FMPI2C1SEL_1_MORT           ((uint32_t)0x00800000)
#define  RCC_DCKCFGR2_CECSEL_MORT                 ((uint32_t)0x04000000)
#define  RCC_DCKCFGR2_CK48MSEL_MORT               ((uint32_t)0x08000000)
#define  RCC_DCKCFGR2_SDIOSEL_MORT                ((uint32_t)0x10000000)
#if defined(STM32F446xx_MORT)
#define  RCC_DCKCFGR2_SPDIFRXSEL_MORT             ((uint32_t)0x20000000)
#endif /* STM32F446xx_MORT */
#if defined(STM32F413_423xx)

#endif /* STM32F413_423xx */
#endif /* STM32F412xG || STM32F413_423xx || STM32F446xx_MORT */

#if defined(STM32F410xx)

#endif /* STM32F410xx */

#if defined(STM32F410xx)
/********************  Bit definition for RCC_DCKCFGR2 register  **************/

#endif /* STM32F410xx */
/******************************************************************************/
/*                                                                            */
/*                                    RNG_MORT                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN_MORT                         ((uint32_t)0x00000004)
#define RNG_CR_IE_MORT                            ((uint32_t)0x00000008)

/********************  Bits definition for RNG_SR register  *******************/
#define RNG_SR_DRDY_MORT                          ((uint32_t)0x00000001)
#define RNG_SR_CECS_MORT                          ((uint32_t)0x00000002)
#define RNG_SR_SECS_MORT                          ((uint32_t)0x00000004)
#define RNG_SR_CEIS_MORT                          ((uint32_t)0x00000020)
#define RNG_SR_SEIS_MORT                          ((uint32_t)0x00000040)

/******************************************************************************/
/*                                                                            */
/*                           Real-Time Clock (RTC_MORT)                            */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RTC_TR register  *******************/


/********************  Bits definition for RTC_DR register  *******************/


/********************  Bits definition for RTC_CR register  *******************/


/********************  Bits definition for RTC_ISR register  ******************/


/********************  Bits definition for RTC_PRER register  *****************/


/********************  Bits definition for RTC_WUTR register  *****************/

/********************  Bits definition for RTC_CALIBR register  ***************/


/********************  Bits definition for RTC_ALRMAR register  ***************/

/********************  Bits definition for RTC_ALRMBR register  ***************/

/********************  Bits definition for RTC_WPR register  ******************/


/********************  Bits definition for RTC_SSR register  ******************/


/********************  Bits definition for RTC_SHIFTR register  ***************/


/********************  Bits definition for RTC_TSTR register  *****************/


/********************  Bits definition for RTC_TSDR register  *****************/

/********************  Bits definition for RTC_TSSSR register  ****************/


/********************  Bits definition for RTC_CAL register  *****************/

/********************  Bits definition for RTC_TAFCR register  ****************/

